[{"id":980190966,"topic":"gsc","slug":"lluqueno","title":"Leslie Luqueño for GSC Representative","content":"My name is Leslie Luqueño and I am a 3rd year Ph.D. candidate at the Graduate School of Education, hoping to be re-elected into the Graduate Student Council as a GSE representative. This past year, I was elected as a write-in candidate and although it was not originally my plan to be on the GSC, I have grown extremely passionate about student governance and have genuinely found the GSC to be one of my favorite experiences since coming to Stanford. I currently serve as a social co-chair and alongside my other co-chair, Kavya, we have built much of the GSC's social life infrastructure from the ground up. Having come in during a fully online year, I had little idea of what social life meant at Stanford but this also gave me the space to imagine new possibilities. From maintaining GSC traditional events such as the Thanksgiving Dinner and Grad Formal to creating our own events like quarterly nights at Cinemark and trips to TopGolf and San Jose Sharks matches, we have brought new opportunities for community-building after two years of isolation and hardship for many of our constituents. \n\nI have led my efforts with two principles in mind: 1) affordability and 2) bridging the gap between Stanford, students, and their loved ones. As a first-generation-to-college Latina student from a working-class family, affordability and financial equity is at the top of mind because I know what it is like to want to be a part of a community event but not have the means to do so. Thus, making our events as subsidized as possible, and at many times, free, is one of my key goals as social co-chair and as a GSE representative altogether. Secondly, much of grad student life excludes students' loved ones, including partners, children, and other loved ones. It is a result of an individualistic higher education system that privileges students' minds but often forgets about their identity as people with connections outside of the University. I have pushed for our events to allow for +1s, and especially making sure we have events that are catered toward families, couples, and friend groups. \n\nAs a returning member, I hope to continue serving as the GSE representative, and especially advocating for flexibility in the base budget for Ph.D. students and rethinking the apprenticeship model. For Masters students, I hope to work closely with Career Services and facilitate job conversations due to the speedy turnaround between starting at Stanford and looking for a job post-graduation. With this, I declare my intent to participate in the GSC election and hope to continue serving the GSE and graduate student community more broadly, continuing as either a social co-chair or as one of the head GSC co-chairs. ","user":"lluqueno","signees":["erpark","eschell","gmegias","jacobr3","jand271","kjax","koyewole","ljberg","lluqueno","mhorst","skavya","toledano","xtchang"]},{"id":980191007,"topic":"ugs","slug":"dilan4senate","title":"Dilan Desir 4 ASSU Senate","content":"Hello! My name is Dilan (he/him/el/il) and I’m running to be one of your next ASSU undergraduate senators. I seek to merge my background in multilingual trauma-informed health education, policy advocacy on Capitol Hill, and peer counseling with a fresh perspective on the most pressing issues undergraduates face. I am a first-generation low-income queer Haitian-Dominican student grateful for the opportunities Stanford has and continues to afford me and hope to be able to directly give back. \n\nIn the classroom, I am focused on spearheading an increase in academic transparency and more directly placing pressure on administration to create an enrollment system that truly works for everyone. \n\nAdditionally, I am dedicated to tackling the issues of social isolation on campus with special appreciation for the unique challenges faced by transfer and nontraditional students, proper resource allocation and awareness for student mental health on campus, voicing the concerns of students towards making Stanford a more sustainable institution, etc. \n\nI am happy to say that my goals aren’t complicated; Stanford must be a safe, welcoming, fun, and accessible place for us all to learn and thrive.\n\nQuestions? Just want to talk? You can reach out to me on my Insta @dilan.desir, or my email ddesir@stanford.edu if that’s more your style.","user":"ddesir","signees":["nadiac","chrisp26","yywstone","sophiemt","aalinur","owas2301","eaavila","akasha","xlorenzo","eyerust","fbravo","gurmenb","diegok12","ashleyt7","andyyt2","hawe","danna25","nkemobi","n3071651","rshreya","lishan","rafaelss","pronisvh","cfsan86","tinali","ediaz04","nhtran","emily22","karen330","fonsecaj","djcald04","cordovam","outerhv","germanrg","valbanez","sestra68","adagx","ssylvain","asmith26","sengthay","arabof08","rjpizzit","alanaesp","araomit","kimi1215","miclop16","sorianod","josie25","vchiprez","gtsion17","leslyvvv","cjcang","zmouza","ginelle","sophiesz","talharao","mromain","gao2002","nancys03","jiajial","markrc04","miacano","hayab","gabefm","ftantawy","shaedol","daphyu20","esther23","samarium","avaace3","elijahbw","maxjcamp","ptvera","amiri03","bebelv","aew0114","gmart8","gmontes","bmeneses","hmunoz","ccarv","senkaih","bnkwa03","nguyen04","jsduan","kramerrr","calderie","samuelmb","aili","okonkwo","rachzav3","tdarryl","glallen","cnichol","benefarr","cesy04","mamoah","summer04","adehmani","dylanv26","hongmeng","armitahj","sebvas","krclarke","achebe","henakhan","edebelen","lisaing","rocamora","lyleg","agliang","rchiek","mweis2","ngualexa","jules109","jmtejeda","danign","iacohen","isaackan","es3298","jrin","abhiv","chris11","agrawald","gxsoto","samgupta","emblem","ebeharry","kellysb","lrudar","jasagye","juanmart","ndemilew","ivypchen","amsal","ericheng","kkhadavi","ellabp","jdgrayso","willnb","sophiama","lethu","cnoriega","gw3n","imarte","zasemota","etatlock","dwiley26","alixf","cduong03","moraa","pacheco7","pm1220","bskiff","akary","emorenoa","jarren","nneoman"]},{"id":980191057,"topic":"ugs","slug":"matthew","title":"Vote Matthew for Senate!","content":"Hey y'all!\n \nMy name is Matthew Nguyen (he/him), and I'm a third-year undergrad majoring in Civil Engineering. Shout out to all my Texans ~ I'm from Dallas, TX, but I frequent the Houston metroplex with all my relatives down there. I love talking about transportation, specifically public transit. So if you see me perusing around SFO, don't mind me. That's just the civil engineer coming out hehe. Or if you ask me about my time exploring public transit in Asia, I might just start bouncing off the walls. \n \nOutside of the civil engineering core, I choreograph dances for my dearest dance group that I love with my whole heart. I didn’t start dancing until I first came on campus, so starting out my career with MLH has made for a memorable dance experience at Stanford. I also co-direct the annual Vietnamese Culture Night hosted by SVSA in the spring! Putting together pieces of dance, acting, singing and cultural fashion to form the presentation of my beautiful Vietnamese heritage helps remind myself how proud I am to the Vietnamese. Both of these large facets are passions I dedicate a lot of my energy to into enhancing the Stanford experience not only for myself, but for my community as well. \n \nIs this my first-time joining student government? No! I have been very involved in student council during my middle and high school tenure. From a general member to class president, I have gained a lot of leadership and organizational skill sets to lead a team effectively and oversee community initiatives. I also served on the Townview Leadership Council as well as the Townview Executive Student Board for our entire campus. On a regional level, I held an officer position for the Dallas Independent School District Teen Board for representatives across all public high schools in the Dallas metroplex. Having been apart of and worked in so many different teams to accomplish different initiatives, I would love to continue this work forward into my Stanford experience on the ASSU Undergraduate Senate.\n \nAs a first-generation low-income student, I am so grateful for the opportunity to attend Stanford University and be apart of all the great communities that have helped shape me into the person I am today. As someone once told me, you grow up and give back, and that’s exactly what I want to do. As it will be my last year attending Stanford, I want to give back to the student body and communities who’ve fostered such an engaging yet welcoming environment to grow in physically and emotionally. While representing the upperclass population, I hope to be a role model and build for the same, if not a better space for the underclassmen to go through the same engaging community that I was given going into Stanford. In honor of the graduating classes before me, I wish to pay it forward in building for an impactful Stanford experience and hope the underclassmen will do the same to the generation below. \nIn my tenure, I want to bring more awareness and advocacy for queer, Asian-American representation on the Senate. I want to bring more insights to the conversations around student experiences with mental health, especially from experiences being FLI, queer, and/or from an Asian American family. While the Senate has prioritized this year’s focuses to include mental health, I want to ensure these discussions are inclusive of all diverse representations among student experiences. As a civil engineer, I also want to advocate for more effective and enhance transportation usage by the students, for the students. \nIf you have any questions, or just want to chat in conversation, feel free to reach out to nguyen15@stanford.edu or connect via socials (Instagram) @mnguyen715\nThank you for your time, and remember to Vote Matthew Nguyen for Undergraduate Senate! ","user":"nguyen15","signees":["achang23","aky2026","amytngnn","angelatr","audreynh","brivira","caitlynn","cmluong","cmvan","dongchau","drico","hmtian","huadwi","huynhnpa","ivanjj","jas1016","juliavu","kcarolyn","kevphan","ktran25","ldpham00","maihoang","mbfly","mcmai","mohnec1","nboddu","nbui468","nguyenpk","phuctran","rickay02","sestra68","sherryl","stevenle","tinatr","tntieu","tracyha","vianda","vle17"]},{"id":980190989,"topic":"ugs","slug":"briana4senate","title":"Vote #Brianna4 Senate!  ","content":"Dear Student,\n\nMy name is Brianna Janay Macias, I'm a current frosh, and I was raised in Veracruz, Mexico, and Los Angels. I'm a first-generation Latina college student and foster youth.\nI'm interested in becoming part of the undergraduate senate, to help advocate for the needs of our student population. Although I recognize the Privilege, we all have to attend a private University that grants us access to programs and resources we would not have at other universities. I believe there is still much more to accomplish.\nMy platform for the undergrad senate consists of four current categories (Financial Accessibility/Safety/Well Being /Social Life ) and no before you ask I don’t have a cliche acronym or slogan for my campaign, but I do have solutions!\n\nMy platform proposal can be found, here\n\nI would like to note that there are many things in need of improvement that I did not mention. If you have any suggestions, I would be happy to implement them in my campaign, as my job is to be a vessel for the student population and their needs and wants.\n\nIf you feel intrigued by anything listed on my platform, you can show your support by signing this petition!\n\nI look forward to meeting you ( At Stanford, the odds are in our favor) \u003c3\n\nIf you have any suggestions, comments, or concerns you can contact me (janay17@stanford.edu) and on Instagram (itsnot.janay)\n\n\nVote #Brianna4 Senate! Vote #Brianna4 Senate! Vote #Brianna4 Senate! Vote #Brianna4 Senate!\n\nBest Wishes,\nBrianna Janay Macias ","user":"janay17","signees":["abloom49","adanm768","adehmani","aescal","agmsharp","alixf","alonzia1","alynalu","amdedios","angela20","angram24","antonioo","apreciad","aprilpac","avc26","briana22","bristueb","calderie","catbui","celinach","cfsan86","cketchum","cklavon","crkang","diegok12","djcald04","dkavi","dorap108","dulmrt17","duruu","dwiley26","ehadar37","elijahbw","elkinm27","gaustinb","glallen","gmart8","gmontes","green1ee","gregkal","gwk","hasan17","ihsaan","jalegria","jaraujo","jatzia","jessipr","josie25","jrlp","jsduan","juliappr","karen330","karlarom","katsm","kellysb","kghosh04","kimmy646","kjavi","kjdhir","kpashin","kramerrr","lamya26","lizbethz","lorsm","lozuna","lvargas2","marving","mayamk","mcruz55","mirawan","mirna22","msumali","natalie1","njrod","nsariowa","onyie","outerhv","plengk","rachzav3","rbraz","rjpizzit","rml","rsmonge","ryin0","samdizon","samshors","sanjosea","saraha24","selaine","sestra68","sherryl","sophiama","sophiemg","sophiesz","syu03","tannerc","tdarryl","vren","wbaresi","zoyanf"]},{"id":980190972,"topic":"gsc","slug":"knyame","title":"Kwamina Nyame for GSC Representative (SOM)","content":"I am a 3rd Biochemistry Ph.D. student in the School of Medicine. I have been on several advocacy groups, from the departmental level to the Biosciences. I hope to be elected into the GSC as the SOM representative to get a broader advocacy push on affordability, transportation, taxes, health, diversity, legal fees for international students, and graduate student social engagement. \n\nAs a first generational international student and one from a low-income background, I have experienced some of these issues firsthand and I am very passionate about being a part of providing a solution for graduate students' concerns. Thank you for your support!","user":"nyame5","signees":["eschell","mihayes","nyame5"]},{"id":980190981,"topic":"gsc","slug":"gmegias","title":"Re-elect Guillem Megias Homar for the GSC","content":"Re-elect Guillem Megias Homar to the Graduate Student Council.\n\nInitiatives that have been pursued:\n• Led and authored the Bill on Affordability, a report on the financial straits of graduate students at Stanford over the last decade. This document sparked this year's broad efforts on affordability by providing a quantitative and accurate assessment of students' finances. It has been used in discussions at all university levels.\n• Worked to hold administrators accountable to graduate students. Our little success, made us pass the No Confidence Vote. \n• Advocated for expansion of the Grant-In-Aid program: mental health expenses and thefts are now eligible expenses. \n• Advocated for international students, asking for further staff at the Bechtel International Center and advocating for a visa fee waiver for international students in need.\n• Organized the Stanford Magical Night! A huge success that we might repeat this coming year in collaboration with the UGS.\n• Advocated for Lloyd Wright's Hannah House re-opening: coming AY23-24\n\n\nInitiatives that will be pursued:\n• Lead and author a Bill on Transportation, a report on the transportation usage and concerns of graduate students at Stanford over the last decade. The hope is to spark a broad discussion on how Stanford should take leadership among peer institutions on sustainable and accessible transportation. This includes CalTrain Pass, expanded bus routes, and additional budgetary allocations to transportation.\n• Advocate for Engineering students. This year, following the efforts on affordability, a one-time $1000 stipend was given to Humanities, Sciences, Medicine, and Business students. I will continue the efforts started with the Petition to make sure Engineering students are also helped.\n• Keep supporting Tax office hours and Tax support for graduate students. In particular, for international students. \n• Promote social events that help students engage with each other and help with loneliness at Stanford.\n• Introduce a Q\u0026A session for VSOs, to ensure regular feedback and improve communication.\n• Keep trying to hold administrators accountable.\n• Voice any student requests from the GSC and support organization efforts.","user":"gmegias","signees":["erpark","eschell","gmegias","jand271","kjax","ljberg","mihayes","skavya","toledano","xtchang"]},{"id":980191058,"topic":"ugs","slug":"drico","title":"Let’s Have Some Fun","content":"Hi Guys!\n\nI would like to see more funding go to off-campus trips for students. I think there is a lack of funding for these trips and I think low-income students will feel more welcome. This is the main thing I would support in the Senate. \n\nBest,\nDario","user":"drico","signees":["ag8a","avilla16","bstrau13","dsallis","ejd47","elianac2","gdmagana","gradngar","ikrement","jacks25","jedi2000","jesse24o","jfidawi","jlasiota","jshack","kangzx","kguvendi","kkhadavi","lalkhani","lwca","mariogn","mohitn","mothana","nboddu","nguyen15","oledbury","sestra68","sidyu","tmadhin","vguru","ykadadi"]},{"id":980190969,"topic":"ugs","slug":"ariforsenate","title":"Vote Ari Arias for ASSU Senate","content":"What’s up everyone. My name’s Ari and I’m a sophomore hoping to be an ASSU undergraduate senator. I want to run for this position because I believe Stanford isn’t only the best school in the world, but also the best place to live, grow, and make lifetime relationships. I’m incredibly grateful for what Stanford and all its students have done for me, and it would be an honor to give back to my community. ","user":"ariarias","signees":["aagris","aayanp21","adenb","adibora","afelton","alexlee3","amarcum","andman","andrea03","apavel17","ari17","ariarias","aselwyn","avakerk","avatiff","bbower","bella06","benkroul","beverhey","bzk","calderie","cam4567","cdlr","cfsan86","chbravo","ckindsch","cramos25","csmurff","csossa","ddl","diegobus","drewmess","elee23","emilinm","fin","ggg425","gradyh","gseir","hoskins1","huertam","igormley","isagxd","iskhare","ivypchen","jabarca","jacobriv","jagross","jaimeem","jallchin","jankelow","jaxfloyd","jaya10","jchud","jeremybm","jmtejeda","johnfoun","joshwal","jtransom","kellydan","kesbaker","klaraat","landonw","lauhowe","leeallie","lholiday","lhughes2","maff2023","melany","mjacquez","mkounga","mottesid","msomers","ncsuresh","ngoodwil","nicortes","njr37","nmaltz","ohmpatel","omfarkas","parthav","peterc25","pipervw","rjrios","robins25","rselwyn","rshreya","rt03mas","sagehs","sarahsjp","sbenabou","sestra68","sherryl","shuster","skpritch","sontee18","sophiagd","tdarryl","tedhick","tgilli","tobey","tsneed","varanda","wberr","wbriger","wgibson","zteplin","zzafran"]},{"id":980191076,"topic":"petition","slug":"heavybagsatacsr","title":"Install Heavy Bags in ACSR Milas Studio","content":"As you may be aware, Stanford has one heavy bag on campus in the AOERC weight room. Although one bag is better than none, the bag set-up at AOERC is far less than ideal. The bag is constantly having to be taken down, leaving users bagless for days or sometimes weeks. We argue that this is due to the improper location/set-up/mounting system for the bag, and we propose that a variety of heavy bags get installed in the ACSR Milas Studio, a much more spacious and suitable location.\n\nThe current location of the bag doesn't work for many reasons:\ni.) the user of the bag takes up too much space in the weight room,\nii.) there's increased risk of injury in both directions (e.g. user may accidentally hit/bump into someone walking by; user may trip over someone else's weights while hitting the bag, etc.),\niii.) the frame that the bag is mounted on doesn't allow for movement around the bag, and greatly limits kickboxers to the angles at which they can kick the bag without kicking the frame and injuring themselves.\niv.) for kickboxers: it's against the rules to take our shoes off in the weight room, yet we cannot kick the bag with shoes on without potentially damaging the bag,\nv.) the bag is very loud when being hit and likely a nuisance to other gym-goers,\nvi.) the bag, when hit, shakes the entire frame which it is mounted to. This frame is constantly being used by other gym-goers, and again, if not just a nuisance, can further lead to injury.\n\nWe propose that a variety of heavy bags be installed in the ACSR Milas Studio. Below are direct counterpoints to the above list of issues that will make clear why the ACSR Milas Studio is the best location for the installation of heavy bags.\ni.) The Milas Studio is extremely spacious, and adding heavy bags along the wall will hardly take up space relative to the size of the room,\nii.) bag users will have all the space they need to use the bags without disturbing other gym-goers, and won't have to worry about tripping hazards\niii.) given that the bags are mounted using proper heavy bag mounts, the extra space in the Milas Studio should allow for almost a full 180º of movement around the heavy bag,\niv.) There are no shoes allowed in the Milas Studio, so kickboxers can kick the bag without shoes, as they should be,\nv.) The Milas Studio is separate from the weight room, and usually not in use aside from the times that the room is reserved for clubs/classes/etc., so noise should not be an issue\nvi.) again, if the proper mount(s) are installed, the bags should not cause any issues/disturbances for the regular gym-goer.\n\nSome extra reasons:\n- Stanford will have the new option of offering heavy bag boxing classes by which they can create a new stream of income.\n- Most Martial Arts clubs, most notably the Stanford Muay Thai Club Sport, use the Milas Studio as their practice space and would greatly appreciate, and make great use of the bags. \n- If the Milas Studio aesthetics are an issue, custom bags can be ordered that have the Stanford logo/colors on them.\n- Stanford Muay Thai is volunteering to help in anyway possible to get bags installed in the Milas Studio (e.g. helping choose which bags/mounts would work best, helping with the installation process, etc.)\n\nThank you for your consideration; my contact is below if needed.\nP.O.C.: Austin Salcedo, President of Stanford Muay Thai, asalc14@stanford.edu","user":"asalc14","signees":["aadityap","acuevas","adenig3","adnanrm","ajpat","alee2187","alin898","althorpe","alyndm","amc58","arjo","asalc14","asdm","blainedz","bmrojas","borisoff","briannat","brookeq","carloshz","cfsan86","cgwalton","chrivill","clairel9","cobbmack","cparisua","csblack","dieber","djhyun","dmag","dtroyets","ejd47","elielkin","emmyst","ericke","esaracay","estherr","fbravo","felician","frodsil","gogalt","grey1024","gserafin","hdzdalia","hhaidari","hshelden","jajohn","jesszhng","jisaburo","joceyu","josselin","jrizo","jroarty","juliogmz","katwu","kelswong","kguti92","ktm9632","lrn25","lrwolfe","luciw","mateusgh","mfletch","mmettias","mradovan","mridge22","mvilay02","nicolese","nina11","parkjs","pennyshi","pguzmanl","pilli","ptvera","rcarino","rchor","rfinley","rickay02","rodolph","rogerxia","rostil09","ryancp","ryuan03","sarahrm","sherwinj","shiges","slin11","sogade","sppc0004","ssruthi","steven57","sylvainp","tcarmen","torlobos","vhelm","willow","wongtina","zlanter","zorah","zouberou"]},{"id":980191008,"topic":"ag_petition","slug":"sole-funding","title":"Fund the Society of Latinx Engineers!","content":"Dear Undergraduate Community,\n\nWe're reaching out to ask for your help in securing funding for the Society of Latinx Engineers (SOLE)!  We currently hold 100+ events a year that center familia, outreach, academics, and professionalism. This includes Diversity Study Nights, Faculty Dinner, SOLE LaIR, SOLE Professional Headshots, sponsoring individuals for the SHPE National Conference, Movie Nights, Study Breaks, After Hours, and more. SOLE's goal is to support all those who want to study and diversify engineering, especially those from marginalized identities such as our own. We would greatly appreciate your help in signing our petition!\n\n---\nI am the sponsor of SOLE’s annual grant petition. I can be reached by email at selaine@stanford.edu or by phone at (915) 861-1867. Do not hesitate to contact me if you have questions about our petition.\n\nAttached is a copy of our approved annual grant for the current academic year (2022-2023), our proposed annual grant for the next academic year (2023-2024), and a list of our expenditures so far in this academic year.\n\nSOLE applied to ASSU funding for the first time last year. As the process is very complicated and long, we did not include all our spending because we did not have prior receipts and spending the prior year was limited due to COVID. This year we resumed our normal operations and thus the increase in spending. For years SOLE has been dependent on the donations of corporate sponsors however we are trying to completely shift away from that and receive all our funding from ASSU to limit the impact sponsors have on the content of our events. \n\n*Must use Stanford University email to access links*\nAnnual Grant App (2022-2023): https://drive.google.com/file/d/1jbkCUoww8YmsCTtcJ1LhqGJCbbRlyOsn/view?usp=sharing \nAnnual Grant App (2023-2024): \nhttps://drive.google.com/file/d/18oMeu8Gk6QUs7cZ6gUiq2Zm_ibBkg-7a/view?usp=sharing\nCurrent Spending (2022-2023):  https://docs.google.com/document/d/1RWpaYL5rA9OG4Pz2MvtGtTcwYW_TQHvWFp83q91vqjY/edit?usp=sharing\nThank you for considering our annual grant petition.\n\nSincerely,\nSelaine Rodriguez","user":"selaine","signees":["krisnino","avocado","naomisol","lianeozo","jubiswas","peterjb3","tuananh8","analiath","asarvesh","mmairena","mccorrea","andrewvl","larissal","miaschau","dilnaz","joshia","lalkhani","kmoy14","cregan7","natashap","tiaram27","chrisp26","skonar","jingyili","tschw190","jzients","tjp2608","victor5","jyshih","knatalia","dludeke","reynante","eastaugh","ekunz","davedunn","callia","crystalm","yjulloa","arcraven","mtillery","egurwitz","adrazen","jluyang","aiyannah","vrindams","lnorte03","hburney","ngeller","tanvidg","fas22","ttliu00","kjavi","ego627","dlumkong","mha1","eliana22","sfwells","lbrown27","baom","jpobega","brianamb","ellied","arnobdas","lpgill","cornwall","isaiahd","caminero","ericsf","nharvey","fmcerk","smhansen","mhz","sarah777","ehiguera","zora814","rmalde","rekhar","erick25","cmacavoy","terrones","olivia00","rstutz","ctresnan","yankowit","mhaile","sirdavid","ramos16","ereyes35","arivas14","steph8t","er615997","idv1222","ljfilgas","elee0324","akupor","chaydbro","kroegerj","toledano","dgarcia6","cbouden","acoll3","mayacz22","jodalysh","jnm22","tkaroff","meaganm4","mirandal","michschw","asaldana","jss42","ctandon","kavs","lxia12","lukaslj","isaaccaz","kmettler","kianahu","aiyer23","ajay4","khan23","kanoeaiu","sarrah","sarahyri","tdonatto","rileysh","ftroy","mgolding","aspillai","hugobudd","groy","olivlamb","sath","djwoo","samuelao","rmccabe1","mreinstr","jolah","diegoraf","nehajp","smithcm1","salvamik","ajarno","goldenl","ojeaburu","jackie23","ruben905","jthaman","amyflo","sophiaj","jueunnam","kagould","gsheen","amromo","aalinur","jarnold1","chokia","gmcrooks","sbedoya","garethc","jazminr","eavila14","hsdow","miibarra","vgorum","aldenor","jennxu23","amistele","cuche","josue23","racheriv","ecyfemi","mcmassey","kryan1","cjikeda","bengeda","aroram8","mcasti02","brand23","bella18","allan300","danwr","patil23a","andreatl","juan2258","vongchan","alvalagu","toria","jcervan","ldenson","kimheng","carlosir","jjdiaz","kathmar","winewton","grojano","tmtrepte","leannale","cameroni","vicky23","ryantb","kayson","jchen465","lbchou","lslawson","jeflores","mtavasso","jquin01","cxiang","efajer","sramsey9","waymon","luciam","owas2301","mailesp","annien23","louisez","sophiego","pr01","amelialt","kavarkey","astills","kyabrown","bvought","accharl1","carrtre","bgalici","vazquezf","amanda29","dlewis01","mmkhalil","stephcp","davidgzz","helenahe","hoangnt1","huadwi","achang23","gemaq","ecambr23","hiran","rguan","joleu","eluna1","jihongni","aaronli9","enichol5","ben512k","mrieken","anna12","athenayc","mkannan","glendas","elainehg","dauber23","kleahy23","canmai","kge","abrmba","cecivale","zhuoj","keippj","rafeea","czh23","eaavila","gmesa","kwc","nyazzie","dalgazi","leslieec","lmarroq","linhdan","ciara","bmartin7","evekuo","karlamg","folasade","emilyguo","akasha","henrymc","soniaj23","smeunier","cmelone","soniaici","angelsc","tatiw","tolitate","jsolanor","sasloan","jwang01","jbilir","xlorenzo","asalc14","delwel","monaavr","hhollen","bkwells","saniss","suavillo","daniel02","rlporter","tdadams","bkuglen","jmcanez","katielb","taylormb","yadirac","santiag0","brpham","dahmad1","medina12","salfaro","ctdesa","cytang","ngocng","giana813","geanamm","cnayr","romero28","kehernan","mrodz","epalafox","pawmarg","cp0249","drico","ginger24","clarehx","sb860219","buenarte","ameliajb","bbower","nboord","sbeck02","balbin3","nsaraig","carmine4","danelian","shefali2","cath24","mgrabb","csc516","reesed","jflores1","irmak","rclinton","nedonkor","zincoop","egfarah","gcrt0701","ehui","mzbj002","kohik","mjacquez","mitalik","mjardetz","mayajg","evajones","mhutch24","afnaan","gaustinb","ag8a","benjm","flurie","gdmagana","josephgm","jayelasl","ymabene","stevenli","rokeefe","mohitn","bryanta1","mbonanni","mariogn","nmo","hannahoo","cullenoc","huynha","marcopm","yqazi27","esrincon","lsibley","eliska","bpatrick","grincon","george02","thaliare","ethanr","sadorian","gseir","calebr2","maxcshen","ivantoh","leawt","ewang24","makennat","itavarez","vsvreal","mszhu","borbon","acwaterf","pawanw","smcc2025","achan51","kwamj701","changrc","lkmsf","beccaha","hauphan","sframe","yuliana2","kylafig5","dgfrias","jesse24o","erod2029","phuctran","szhao415","journey","havenw","eveliz","karlarom","tinatr","gyang11","kzepeda","regcsev","mmarkley","novawu","sree02","colehc","embunna","lcarlin","annikaj","ercorona","riensche","lypineda","alyndm","cslagle","hywot","amhong","fbravo","aishaola","jtransom","jmo101","aunag","klambert","kpodosin","pchx","cmvan","shreyava","ejd47","ifreitas","adrianoa","priscirs","gurmenb","pvakella","ronsongo","gilsaenz","mkconn","mmurray5","juliacd","aechano","wang0kai","emilio18","isabeld7","dulmrt17","malinac","cpedraza","altheah","mjaylene","gbhanson","elliezy","dakras","andrea03","badillo","edwardq","mishgov","bryan101","vherdz","adachuk","carsmith","mctanaka","hecriv23","jenfung","bryana6","dlisa314","sgfan","lmalacon","rosa2024","beckym","swambu","defjan","tuant532","pflores1","clisama","jweiler","skhine","aparrott","ayannam","vle17","rbraz","andyyt2","abspring","sronaghi","ixxia","tejasn9","baumanl","katyasan","gamach","achavez0","meseretb","ajzheng","suahmed","kaylacol","cmuang","stevenle","amayam","alexaab","ndmoreno","danna25","kzylstra","bsalt","lvargas2","nkemobi","marielc","labroche","hspann","jamorice","smad500","mikosg","sfuji","csun7","sachen","vchim","garing25","zkim03","khuyen02","allisj","sniehaus","afuloria","arturoh","sydneym","ztweedie","pabloram","catcelio","ananyasv","mrh25","cramos25","ccarrete","mariah03","jackgiv","faithaja","mjim6122","alicel1","tdolkar","wherz","apreciad","mgmalik","lindav","lbraun15","giltov10","sagems","rcon390","aescal","kristyc","xcruz","rsmonge","dylanrd","schiu37","psarin","eapple25","peterc25","cryst29","sabaw","hclay116","kdong73","ellison9","jen1106","jesusb25","elhasmz","faithf","lichar","jkaosowa","diegogc","jasmyn","hgris","bjaffe","mhawk","kenma25","amarcum","nsmejia","rliebson","mahina","chasezj","iluna","alee2025","dthlang","gskbagga","lusansal","melquan","kano","dnortiz","mswisher","rishirv","ericktrs","miktupaz","thaiv47","ksingh03","nredhair","diyasabh","jtrb","reneedw","jflodin","emacias3","natcr415","bcleve02","dangold","akw421","n26408","afarfan","krojas","rshreya","kjolly","sungcl","jodieme","nelsonth","mchhay","kaymyers","jennaali","ajung16","annag25","aanya","panitar","karinali","isapista","jaesobs7","naomicyb","sjc143","zoeyhill","samiyazr","baihan","albertr","dorap108","wwyoung","ajguo","meganloh","airinbvm","svelazq","jkatz25","lesliequ","dmag","liannek","aprilpac","kaelyn01","screyes","savahnap","bhlawn","shubhra","marasto","larizmen","wcrowell","pjkim","elizamg","alyssali","grace23","yimt","gargm","sabino54","victor25","pjovel","lishan","daphnehl","cmgbahur","lh03","jctalbot","torihoge","sofiast","leesusan","lorapv","jaedyn99","glizama7","pearlsr","ebrad2","willzli","kfufunan","jg104","imanomer","elleny","robz","mahleta","fraphael","theber","jantorr","deriches","ingino","benkroul","alag","mgr19ph","mkalu","lmohamad","amysz","jaylatay","nahian","clshao","katiel25","mcruz55","johnflx","brysigg","kc2025","jazgonz","esmei03","jrizo","khw","abby2901","ryuan03","aworley","mendez19","ninettec","nktl","sdsam","cruzrios","amyzhai","paradin1","annaking","yiman","lrreyes","listella","sarahern","wbaresi","marving","ryanesqu","kaitcs","crysbern","ndorame","shstor","bperk25","grace24","camilafm","tenzing","mismail1","tiffany0","pnsahoo","myrka","slangevi","ejj1","dsallis","mirelys","pjasmine","calcntar","asanyal","howra","sosiday","uuind","zhanf","hazel25","huynhnpa","caitlynn","gnmoore","dpichay","jolenel","zouberou","tenameza","sppc0004","sarahrm","xavierg","cfsan86","kgz22142","xime","juliaf8","lorsm","klopez01","sylc","asterra","lac0306","kevin26","jasoncl","pizarro","zehrlich","gregkal","kdimock","tinali","lozuna","jasrod","charjcp","vpaez","dianasg2","ediaz04","mbravo13","dayal","diegogtz","emily22","ovq27","fcerda","karen330","chrisl08","karenbar","jonwill","fonsecaj","narment2","emrtnz","yazminpa","alvega16","dloth","djcald04","jessqui","rawleyh","jchav21","joshdelg","nadint","cordovam","angel8a","bmendezm","eholm","outerhv","aperez21","germanrg","gerardoa","mcarbaja","keila","icorrea","valbanez","jessipr","earteaga","tanmayg","delianne","ericrcr","kevjhnsn","jirehm","sestra68","jesser18","adagx","magaly02","lenaxvii","amanda19","estewu","ayanag","hferg","parthiv","sachino","evuong","efeleke","mygoldin","taekyu","cebrown1","sbenabou","sengthay","aeberts","briannaf","scrable","lernest","jatzia","jbelardi","zedelman","mirasv26","heitners","amendoz1","brivira","awei25","eebssa","euc","dstratak","isagxd","sylviecw","malayeri","angela20","mirliu","delrio","jfairlie","ashleynm","logansch","joel101","lindsayy","kyu2024","gianny","rmabdull","aky2026","kpashin","kszheng","melinast","jmb25","natalyal","sackey","diegobus","csittler","maryamt","kumarvig","vivigles","dtsan45","ccheng26","rubijsb","lquinta","alanaesp","gpolite","cnicks13","crollock","ksmadrid","rparada","natram3","chehan","cesarrod","aoden","yjenkim","piperf","nomin","jrlp","stardoby","lixiaofu","jadeng","araomit","luis1031","kimi1215","miclop16","sorianod","josie25","mah2001","anab13","javokhir","allise","elisama","vchiprez","vivian24","leslyvvv","ktran25","yarencya","jsnl","jess1618","jmdavids","rjmoore1","huilanh","eplate","rllata","yamilett","svaughn4","zmouza","emirueda","jchens","ankrull","sivale28","chazlync","aliceku","ginelle","mario24","pritir","langaney","lyzetmh","sophiesz","abeldag","talharao","dswinton","tjehl","hokj27","mromain","lizbethl","mmtovar","ejatluri","nathi","kresnick","pmnoerto","cathyhou","briana22","jiajial","nickbuck","snbloom","markrc04","lauralb","juliappr","coledd1","miacano","smacharg","vasqueze","bigsean","carellg","tracyha","agupta07","nsala","igmalik","byacdiaz","cduran19","sebcolon","iroman13","badilloc","alicezyc","michpark","amytngnn","galias","ekamas","ananya03","rwixen","matthtan","a9koh","hichews","cwgrant","gbertran","sherryl","selaine","luna1206","oreyes1","bdiallo","noelma","tawosile","eschwab","sbrito","ardl","kimblrly","trappv22","monsehze","arjvik","salamezc","gabefm","juliogmz","acuevas","sh20c319","amritam4","kim0409","pvazquez","lucib","gsantac","tshim24","mgoodson","esoroka","ediff","juliavu","kotov","anjalirg","amrossi","schieber","mohstrom","svalente","alyssamu","aileenle","mjfox","janevare","ijuarez6","ipassos","zteplin","wilmer23","mhar","rodrigo0","jmba812","amaru","sophiagd","mpeters4","amdedios","ypajibo","zunaraha","wangeles","alisaga","richcoca","jamesu72","nhupham","rmorelos","thedges","zarahsan","samdizon","akhawaja","lwinkley","smixon","rcastane","esther23","nclemans","ncorrea4","illiana","jchen18","samarium","patwei","neelk","aluffman","mottesid","majohns3","jhundal","maa98","edwardgc","andreeaj","meganmou","skynoh","bamaro","elijahjv","adeloera","amados","alatorr3","avaace3","elijahbw","abieiden","jxyan","mdhicks","renn2024","chloerom","mgan","stpshrkv","eorozco","merrilla","cmaximos","sereese","amiri03","arushig","gmart8","critelli","mukikozi","dcastrom","alicelr","egarcia6","gmontes","bmeneses","rmwoody","hmunoz","lsalaz","ccarv","cdlr","imh","jennam1","acleyva","jackmao","ereyes23","zunic","jasminev","ashleymc","ethanhsu","erouffy","sebasur","jw20","haytenf","jazmineg","estemend","celewis","josern29","lowens21","natcharf","eflorand","bnkwa03","kwerwath","nguyen04","afhudson","arzola26","mohnec1","marcchap","eduardes","lucianab","wooderi","liamfay","jhthai","jkong2","kramerrr","alainp23","lkerner","calderie","doueiriz","rcarino","bkinder","juansd","samuelmb","chavicoy","acort221","orelle04","rosmar18","abroome","aili","toriqiu","okonkwo","koyewole","rubyh","kghosh04","haileyh","rachzav3","daisywyh","alanamb","glallen","elijahk","apenzer","lizbethz","izzyterr","cnichol","benefarr","yabraham","alinadav","sayp","cayalabe","conniehg","lorenzak","chrisglc","brdel","aribarb","byeung","rvillada","wynter","dwoong26","richchen","zorah","bless","zoecm","kaif","aminor23","brlum708","cgwalton","arsharma","alexyang","rml","dawn9","luciw","kjdhir","cce5246","sebvas","kjr20527","ckenz","crkang","annacr","chhavi","dannach","sarahlst","ddesir","kennycep","lisaing","ngumel12","brendago","jluzhang","gabreu","local978","achavez7","tylerga","agliang","jonath4n","rathi","newsom","savargas","afajardo","whittj","mdmattei","wmusyoki","ireneyan","slee93","sandos","lauren04","willsh","annabc","walshp26","eataylor","sherylh","jmtejeda","samchen2","iacohen","jessuman","evsong","lilianch","dukesr","es3298","abhiv","chris11","joewar","gxsoto","eabarca","rebecwu","antonioo","ellathtz","heloiseh","omfarkas","kellysb","erinye","tellez04","wileyyu","naveenr1","sesteva","sophiabi","esidhart","jasagye","jjakpor","kimdngo","leeij","sabayev","kaguila5","ivypchen","amsal","nabboud","floray","jennywei","avnivats","fongsu","wangandy","elanna","kmayu","irogando","willnb","isaacdg","jdavid11","sophiama","mollyom","samc10","destinyj","jgal","imarte","aromanra","giseller","tovarmm","mkc3399","broque7","ashantin","jbroma","katcosta","mg090104","isaiasm","acolli","lilaanne","mnjeri","nguyenbk","tvasudev","laurenyu","cduong03","hpescaru","ah072084","sbarnes1","avc26","ayiyang","ggm6","shise","siyagoel","emily712","jcamara","tooba","carloshz","timjing","kenbui","jerred89","rranjan1","pm1220","a1090588","krodri02","enrocha","kimmy646","ceeng","jaymimc","jackiede","pengevan","mmearly","iogalle","amagalla","svolman","akary","ruz","tayne","emorenoa","lolamcal","nejo","jchoi23","lwaites","wgolub","jasleen","fjg2024","claireyu","maylingh","ekohrman","bkongtav","mdontha","esaletan","cbfarcan","sofiagon","atorresc","oziegler","corncob","dblawlar","campos03","janehrdz","brenrene","bbyan"]},{"id":980190968,"topic":"gsc","slug":"kjax","title":"Kristen Jackson for GSC Rep","content":"Hi friends!\n\nI spent the past year on the Graduate Student Council as the Diversity and Advocacy Chair. I have spent the better part of this school-year advocating for and working toward student affordability and awareness of affordability issues. It was my firm belief that life at Stanford for graduate students would be vastly improved if students received a stipend increase commensurate with inflation and cost of living in the Bay Area. Santa Clara County has determined that graduate student compensation at Stanford qualifies for the 'very low' income category. The effort to push for affordability was a joint one, and it has been a pleasure to work alongside other councilors toward these efforts. \n\nNotable actions from this year are the Bill on Affordability and the GSC's Vote of No Confidence in Stanford Administration. These efforts were in attempt to continue raising concerns of students around affordability, transportation (bringing back canceled Marguerite lines), and access (continued push for affordable healthcare). These issues have been central during GSC meetings, Faculty Senate presentations, and campus-wide advocacy efforts.\n\nIt is my hope to continue this work next year. I have formed incredible connections on campus with faculty, staff, and students, and want to continue leveraging those connections to advocate for students. As the outgoing BGSA (Black Graduate Student Association) president, I am hoping to continue reflecting the interests of graduate students, and ensuring the inclusion of BIPOC graduate students, FLI graduate students, graduate students with families, and graduate students with disabilities in GSC proceedings. \n\nServing on the GSC has been a pleasure, and I would be honored to be nominated to return. Thank you for your support! ","user":"kjax","signees":["erpark","eschell","gmegias","jand271","koyewole","ljberg","mcshea","mhorst","skavya","toledano","xtchang"]},{"id":980191077,"topic":"gsc","slug":"rickyhage","title":"Ricky for Council","content":"As a CA and president of the Stanford chapter of oSTEM, I have been actively involved in planning events and professional development opportunities around Stanford for the last two years. I will continue to use my platform and wide connections throughout the Stanford community to advocate for graduate student needs in relation to pay, housing, transportation, food insecurity, safety, and the general campus community.","user":"rhage","signees":[]},{"id":980190993,"topic":"ugs","slug":"kramerforsenate","title":"Kramer for Undergraduate Senator","content":"Sign this petition so Kramer can run for undergraduate senate!! \nWhy Kramer? Because she is bored and loves fun. \nWant a waterslide? Vote Kramer! Want puppies and alpacas? Vote Kramer! Tired of reading this? Vote Kramer!","user":"kramerrr","signees":["adehmani","aili","ajadhav","akary","calderie","dawn9","ddesir","djcald04","eaavila","eapple25","edebelen","fonsecaj","gaustinb","ghernan2","gmontes","gregkal","gurmenb","hasan17","hongmeng","huertam","idavis","inehring","iroman13","isaackan","janay17","jmolloy","jmtejeda","karen330","kasha","katiesav","kkar","lawr3nce","lsosnick","massiel","natalie1","ngualexa","ptvera","rchiek","rshreya","samarium","samuelmb","sengthay","sestra68","sherryl","sorianod","talharao","tdarryl","xlorenzo"]},{"id":980191009,"topic":"ugs","slug":"dawn","title":"Dawn for Senate","content":"Hi all! I’m Dawn and I’m running for undergraduate senate. I care about support for FLI students, sexual violence prevention/accountability, and workers rights. Vote for me! ","user":"dawn9","signees":["aallen02","adehmani","aew0114","agliang","aili","alicezhu","alyssamu","aniketm","annase","apatil26","arabof08","araomit","ashleyt7","ayad38","aysun1","azguo","bkinder","calderie","cbeamer","cbfarcan","ceesa","celewis","chantal8","dawn9","dcureton","diegok12","dorap108","dsallis","elijahs2","ellabp","ellaw","emily712","emmawong","evashen3","gavinmcd","glallen","gmesa","graceaji","guck","gwk","imarte","iroman13","ivypchen","jakeleon","jamesu72","jaylatay","jimmyfox","jlopez04","jmfinley","jmolloy","jmtejeda","joefata","judewolf","jwen93","jwhilby","kallielv","kemorgan","kenlal","kghosh04","kmw1217","kramerrr","ktm9632","laurenyu","leeqin","lizamik","maxjcamp","maxrod","mbuyan","meiers","mirna22","muntingf","mweis2","natrush","nhupham","nkehoe","o6684211","oziegler","phoenixc","pjdagsi","ptvera","qlawler","rduross","rshreya","ryanmtle","sean777","sestra68","shaedol","sheden","sherryl","shpotter","skhine","sohaylae","sophiesz","stanny04","talharao","tdarryl","tjp2608","tuffourv","vhe","wbtolson","willsh","yarasev6","zasemota","ziminq"]},{"id":980190994,"topic":"ugs","slug":"ballinbella","title":"Bella’s petition lol","content":"Hi, go ahead and sign this petition if you love your family and want to pass your classes lol. ♡","user":"iroman13","signees":["celewis","dawn9","djcald04","gaustinb","glallen","gurmenb","kramerrr","ptvera","sengthay","sestra68","sherryl"]},{"id":980190974,"topic":"ag_petition","slug":"fundkidswithdreams","title":"Fund Kids with Dreams","content":"Dear Undergraduate Community,\n\nI am the sponsor of Kids with Dreams' annual grant petition. I can be reached by email at egurwitz@stanford.edu or by phone at (956) 607 5067. Do not hesitate to contact me if you have questions about our petition.\n\nAttached is a copy of our approved annual grant for the current academic year (2022-2023), our proposed annual grant for the next academic year (2023-2024), and a list of our expenditures so far in this academic year. Please note that a significant portion of our spending occurs in the spring quarter since that is when most of our special events take place.\n\nThank you for considering our annual grant petition.\n\nSincerely,\n\nEmily Gurwitz (on behalf of Kids with Dreams)[2023-2024 Requested Annual Grant][2022-2023 Approved Annual Grant][2022-2023 Year to Date Expenditures]","user":"egurwitz","signees":["vcarde","krisnino","ykadadi","lianeozo","ncsuresh","analiath","asarvesh","andrewvl","larissal","chris9","miaschau","ncwang19","joshia","lalkhani","laurenkl","xjchen01","csblack","natashap","tiaram27","neilcord","skyhyde","o6324408","casparg","skonar","c8g","kodali","tehmidb","emme","btanabe","callia","crystalm","mtillery","lilyzliu","egurwitz","adevito","mccabe99","flemmons","ampudia","ttliu00","kjavi","olorch","dlumkong","mha1","tarapar","celiadpr","lpgill","tdgress9","ericsf","nharvey","hricioli","parksm","natalie1","rstutz","evendrow","pchatain","kwindley","fedez","steph8t","idv1222","ekneidig","gscull","akupor","sguha22","hyattmeg","seebas","jimmyle","mirandal","pennyshi","hannahpw","rsreddy","jdeasy3","ctandon","kmettler","juliadw","lkeesing","lvblack","tindalla","rach23","ml17270","reganmcd","nbregman","kianahu","mcmetz","aiyer23","sophiemt","sophiej","smiti06","tdonatto","ajliu","amward","rileysh","ftroy","amurran","mollywg","shieinav","joelx","soyskye","njehl","sath","meking29","djwoo","dhall8","jolah","mbrant","kateling","alexloia","nehajp","laytonr","djchamb","castein","lukemann","jhneidig","ehandsel","helenav","matwater","ellawang","amromo","cchoi1","chokia","miaben","jazminr","hsdow","aldenor","amonga17","dgao","teem","lgrove","kpies","lsmith23","callier","bgopal23","cjikeda","aroram8","mcasti02","bella18","allan300","koyealag","nicole01","slove23","csor503","miabrews","ojahagir","htjkatz","djchao","kayson","alexder","lbchou","jeflores","waymon","sstev8","dp0107","louisez","sophiego","jhclark","dyllen","ychen23","astills","bvought","sali786","stephcp","helenahe","huadwi","nirvikb","gemaq","rguan","njlevine","sarahp23","lseu23","zlarson","pcarv","jmc312","elysiaqs","ksmon","syytang","kleahy23","kbuntic","reller","kge","jbotwe25","snbuzard","nfattah","vinhhuy","eaavila","joschien","adricar","natrush","rbarber","porterjw","dalgazi","lmarroq","sohaylae","karlamg","emilyguo","akasha","mjk3","fglopez","gganesan","chorkay","soniaj23","smeunier","cntran","hasant","bshell","rayouf","mjperez","jlofwall","skylerj","asalc14","delwel","bkwells","averylou","saniss","beleigh","rsmith9","suavillo","lgarnett","nickjw","tdadams","bkuglen","tethomp","awalley","campenn","shirawi","dahmad1","cytang","cnayr","epalafox","nitsua","cp0249","natmrrtt","tannerc","eboone24","ginger24","clarehx","sb860219","ameliajb","bbower","etamaya","chen2020","daniamlo","nsaraig","jfidawi","bdharris","gatesr","gcomas","emilyc02","cath24","mgrabb","akfeitz","mifu67","alyssa17","irmak","rclinton","mdeale","nedonkor","zincoop","jcolby","audreypd","gcrt0701","nhungate","niki24","hechtman","ehui","ehsu57","mzbj002","bhochman","mjacquez","akalili","ahkearns","afnaan","gaustinb","pipholl","malaina","skamni","flurie","gdmagana","jclax123","leeallie","cmaguy","aleibly","willmich","angelmb","bryanta1","nhiywin","arunair","dmora02","somolins","esierra","gautham","eliska","grincon","ethanr","sadorian","gseir","hsilva","ivantoh","hctaylor","averygw","csze","leopoldv","ewang24","svisokay","lspunt","cooper2","teddy24","tristynt","ellievia","devon2","borbon","acwaterf","alougeay","nolaye94","sophchun","vwu2010","nsariowa","smcc2025","achan51","jorszag","changrc","meiers","yuliana2","dgfrias","beniam18","samdo","jobrien3","szhao415","journey","tinatr","skreider","sydneyt","nlyles","adav","odeyindm","janay17","nikhiya","schoi02","colehc","ggp","erawat","embunna","steph02","zvnguyen","lcarlin","lbelger","jlflora","gavinmcd","michuang","sylviaga","hbasali","sasg","alyndm","tdschout","budnitz","akps","cgfee","emruwinn","skya","cjaime","jscala20","kconte","jtransom","adenb","taolarge","dfstone","aunag","mayajlee","braja24","vxin","kpodosin","mayert","cmvan","estalcup","ejd47","jdunlop1","priscirs","aileensc","asiar","gurmenb","pvakella","mleone","gilsaenz","ajlynch","aaron626","isabeld7","lafuta","malinac","rmlit","mjaylene","dakras","afeinber","ahryan","cosipaul","badillo","mishgov","bryan101","vherdz","ishaanks","skevane","kmpeng","tony1028","jymoh","nickliem","rmgarg","lraaka","jameszhe","icoloma2","tuant532","pflores1","aparrott","shaunakb","andyyt2","ixxia","patel24","micahxw","etiao02","abbyrose","katyasan","cnaugle","bneault","kenny1g","achavez0","ajzheng","suahmed","laura3","kmducre1","cmuang","stevenle","weihchen","kzylstra","nkemobi","labroche","jsarenay","mikosg","alkupor","evagoren","sfuji","vchim","palomas","ywu25","akbrandt","jcc2025","kaiah","kamoore9","james143","khuyen02","ghowe25","afuloria","arturoh","calebliu","reg02","ztweedie","pabloram","catcelio","sebrusso","mrh25","cramos25","ccarrete","cbdo","afelton","arengo03","jackgiv","faithaja","collinj2","alicel1","nina0910","febielin","dzeibert","valeriex","kellydan","jmccoy03","lbraun15","eluchini","phongngu","psears","rcon390","jaoliver","ulalucas","echoi1","kristyc","lrn25","rsmonge","aperry04","alexshaf","eapple25","peterc25","cryst29","marslani","sabaw","kdong73","jrfinch","dbhatt1","karcilla","iris001","jkaosowa","kskuo","hgris","mhawk","thamhank","ryloo","rliebson","kisemben","iluna","jaeylee","mrozin","kano","mswisher","rishirv","holdentn","msoul","ksingh03","nainoav","gsong17","bcleve02","hmcgoran","veenaa26","manan03","connero","erinsu","andrea99","akw421","hdoueiri","afarfan","nkuo","pgrove","rshreya","jaiden","kjolly","iddah","soonie15","emily111","sungcl","paige24","jodieme","nelsonth","mchhay","layalkaz","jennaali","ajung16","annag25","gracecm","isapista","echow24","jaesobs7","naomicyb","zoeyhill","chloeyha","temibaba","french25","dorap108","ajguo","cgz2003","veejay99","meganloh","annakies","airinbvm","kingstnb","jkatz25","lesliequ","dmag","nchi1","kaelyn01","shgnatow","asmaa","bertagar","fluidivy","shubhra","carowei","zlanter","nreisner","lilavdb","pjkim","elizamg","kdelg88","nhdakad","alyssali","grace23","yimt","gargm","lmorley","lishan","lh03","torihoge","chaelyna","rkacham","rmhoran","mayl","imanomer","robz","jantorr","benkroul","mkalu","jclark79","lmohamad","amysz","willnida","kevinli7","jrbahk","amyguan","esu02","brysigg","kc2025","abby2901","sidg","inava001","ryuan03","spenseay","amyzhai","kealiav","listella","nmaltz","rmjiang","leiivery","ryanesqu","kaitcs","kevinkc","noahhtan","noahyuki","amadary","tgolob","etianshi","cwenardy","anavib","grace24","pronisvh","amaccoun","myrka","slangevi","dsallis","andman","natsins","rosentha","pjasmine","calcntar","sosiday","caseyrk","uuind","zhanf","hazel25","caitlynn","jolenel","adtlee","zouberou","daubuch","youjkim9","sarahrm","weissr","thacht","slongo","orispec","cfsan86","nhafer","xime","mchen24","juliaf8","cyli79","cmurphy6","taigroe","klopez01","mackj","jocelyn8","tegirard","cmcasey","henry26","karinach","lgmoore","kevin26","iwasakih","ckenn","jmilani","jasoncl","zehrlich","gregkal","acessna","osibal","lozuna","jasrod","tsenf","jamieu","marimay","charjcp","ediaz04","oligomez","dayal","diegogtz","emily22","ovq27","karen330","sophiemg","scdixon","fonsecaj","narment2","djcald04","rawleyh","jchav21","raoufs","cordovam","eholm","aperez21","germanrg","gerardoa","mcarbaja","jessipr","angelkuo","kevjhnsn","sestra68","vvajipey","leethbon","magaly02","kbaik","dorsey24","ssylvain","ayanag","sontee18","parthiv","ananyaud","yarasev6","jfetter","sachino","hussamig","taekyu","leilades","robins25","cebrown1","sbenabou","aekpootu","rcatullo","sengthay","aeberts","ccahilly","jatzia","jbelardi","zedelman","mirasv26","amendoz1","brivira","eebssa","dstratak","isagxd","lauhowe","mirliu","lindsayy","kyu2024","rmabdull","kpashin","hunter04","raigosa","gracekt","kszheng","melinast","japnoor","rzwet","jmb25","jnfong","jiajuliu","kumarvig","vivigles","mlintott","dtsan45","jkoj25","ccheng26","ddl","serenakt","stefzoz","rubijsb","vincentx","lquinta","gpolite","katsm","cnicks13","crollock","ksmadrid","rparada","natram3","chehan","piperf","jrlp","kcarido","lixiaofu","bennettb","nickd25","josie25","anab13","gcbel","allise","vivian24","ktran25","yarencya","jess1618","jmdavids","svaughn4","jchens","ankrull","aliceku","ginelle","pritir","alvajosh","tjehl","hokj27","izabella","nancys03","kresnick","nickbuck","snbloom","miacano","smacharg","tracyha","agupta07","cduran19","sebcolon","iroman13","izzym","badilloc","kvwong","yanav","avakerk","kwahal","michpark","hayab","amytngnn","gvadmal","yasserj","a9koh","evageier","ntlim77","jliu74","selaine","tawosile","eschwab","ardl","isabdr","varanda","efilipek","arjvik","salamezc","hrg","jsiskind","gabefm","acuevas","amritam4","kim0409","akm32121","pvazquez","lucib","svardaan","tshim24","dacab","ftantawy","mgoodson","esoroka","ediff","juliavu","mohstrom","mduffy8","krlai","alyssamu","shaedol","aileenle","mjfox","erikatj","janevare","avalove","ipassos","zteplin","shpotter","jmba812","mdr0321","mimoya","sophiagd","mpeters4","amdedios","alisaga","jamesu72","gpradeep","ygarcia4","samdizon","akhawaja","rcastane","esther23","ideutsch","jchen18","samarium","melodyc9","mottesid","jhundal","andreeaj","meganmou","skynoh","amados","jungyoj","avaace3","elijahbw","emsmith8","jxyan","jvarah","renn2024","stpshrkv","eorozco","ptvera","merrilla","amallott","dinarazi","cmaximos","amiri03","aridwan","icjacobs","chenault","bebelv","ericamcc","gmart8","critelli","ashley22","alicelr","fcadete","csarca22","rmwoody","lsalaz","dakotag","ccarv","cdlr","naima","pperez14","katiehef","jennam1","lillian4","eehirsch","jdollard","jasminev","danbaker","kam412","erouffy","abbyfc","kylieo","jw20","estemend","rjsouth","celewis","alt11","tytzhang","lowens21","eflorand","kwerwath","nguyen04","mohnec1","gsandman","caeley","steeleb","lucianab","ehadar37","guisouza","annase","liamfay","jhthai","dcureton","jkong2","kramerrr","torred","alainp23","lkerner","calderie","doueiriz","serena25","elizafs","bkinder","inehring","alin898","samuelmb","chavicoy","acort221","agmsharp","mirawan","aili","okonkwo","kkar","koyewole","kghosh04","fmooney","haileyh","daisywyh","alanamb","aesmith1","pearsall","danielrc","akhouri","elijahk","ngoodwil","cklavon","rjrios","kosi","apenzer","mbloome2","jyoung33","chbravo","sseaton","kathry10","izzyterr","benefarr","alinadav","sayp","cesy04","pipervw","lorenzak","andrewrk","leekathy","sfitz12","alimaye","dylanv26","joshuwa","sutyazz","mkounga","dwoong26","melaniez","igormley","milane","pnova04","eleibo","iszabo","zoecm","haykwan","ewest1","kaif","aminor23","fjafet","cwang26","gflynn22","gstretch","zachwitz","alexyang","dawn9","acris","niam","zoernbrg","sebvas","pranavg","fishera1","smallen","emoeller","kbelardi","skdobson","gprice03","annacr","cvb","ajeffery","bensonw","emoore26","chap","wcleary","massiel","krclarke","idavis","muhsihsi","malekabu","mostafam","ddesir","brendago","hazelj","lyleg","ayumitrn","jluzhang","az1","yahli","skolla","chasemc","dantrejo","amanis","aoberoi","benstein","jwokyp35","shiningx","evunche","kyles7","savargas","whittj","ngellis8","lucyrose","mdmattei","evyshen","catbui","ctraina","mweis2","mikesun","lizamik","jules109","lcarolyn","khealzer","lauren04","dchan04","annabc","zstjohn","lulusul","jmtejeda","samchen2","jessuman","averylm","jacobr1","oroti","askalnik","ejw675","es3298","chris11","smijat","mclewis1","samgupta","heloiseh","omfarkas","joselyna","emily49","vsaravan","tatesgar","ramya1","lauren28","charmang","syan204","riyan","teinish","andrewhp","tanvimd","jhuang23","anushkav","duruu","usahn","jjakpor","ifh919","leemary","chenl8","jkurtzig","alexanrs","crezende","flt","aru04","ekkno","shreeg","kaguila5","anushad","ilaria04","akuik","avaelisa","tabibian","avnivats","sarasuch","phwong","wangandy","aservice","nshtang","irogando","willnb","irenelin","jdavid11","maxrod","mollyom","ajadhav","saitot","imarte","jayniana","ez26","walison","ellarh","cyeh2003","hsosa","smion","clairez","mnferrer","apatil26","broque7","ashantin","acolli","sjoshi4","lilaanne","mnjeri","emilinm","nguyenbk","thardy74","laurenyu","hpescaru","ah072084","sbarnes1","dsshen","aaroncl","adityau","emily712","vnaga","omdpatel","jerred89","jamesp26","leilawg","jfenton","awestley","marsoner","a1090588","alarson5","kasha","jaxdiego","ceeng","rlspence","harmonya","canthon2","jcoronad","acparas","jackiede","germans","milliel","pengevan","theovp","lusciana","nourmary","svolman","akary","zgab18","tayne","gfarley6","emorenoa","jarren","gwk","nejo","nikcaryo","nware4","nickcamp","wgolub","joshua04","atirao","kilasg","sareyes","mdontha","dvaughan","sofiagon","atorresc","oziegler","wbeattie","jsusant","janehrdz","bbyan"]},{"id":980190976,"topic":"gsc","slug":"jacobrandolphgsc","title":"Jacob Randolph for Graduate Student Council (Law)","content":"","user":"jacobr3","signees":["aewoods","aracelyv","ascohen","brimitt","gfeirson","jacoben","jacobr3","jlgmzgmz","maddoxj","mwirene","rdavis24"]},{"id":980190977,"topic":"class_pres1","slug":"lift","title":"L.I.F.T. for Sophomore Class Presidents","content":"Pierre Dagsi, Gabby Edelin, Aili McGregor, \u0026 Matthew Guck","user":"aili","signees":["tjp2608","knatalia","richterw","callia","ashleyt7","ani258","cyli79","tinali","karen330","balba","katiesav","ssylvain","mbuyan","judewolf","guck","sengthay","rmabdull","gracekt","natalyal","gpolite","araomit","adibsood","ginelle","paolagd","abeldag","talharao","mromain","fishera","iroman13","amytngnn","ntlim77","eschwab","juliavu","greta30","ncorrea4","vporto26","elijahbw","ptvera","elisepb","amiri03","aew0114","gmontes","lumi","katiehef","miggyjv","rjsouth","celewis","jsduan","dcureton","kramerrr","calderie","inehring","aili","okonkwo","kghosh04","glallen","summer04","titus000","cnangle","ewest1","akiyuasa","yaraeli","niam","sebvas","zijianl","gedelin5","mpaturu","hjgarvin","massiel","idavis","tsneed","sammom","jonath4n","newsom","benstein","ngellis8","sidnr0se","jennlew","mweis2","ngualexa","jclark26","audreykm","avabrown","eriche26","nolawit","jmtejeda","nneka","jrroach","jrin","bokeefe","salamotb","emblem","tuffourv","ebeharry","heloiseh","kaicharp","esidhart","ljmiller","jasagye","zoyanf","che0chen","nzahedi","leelind8","ndemilew","linkj","vedantch","skpritch","hicksh","nabboud","tganea","avnivats","epmeyers","spzhang","enordin","ntseg","egupta","nanigurr","andrewhz","davidc26","zasemota","etatlock","vhe","caojess","pjdagsi","nguyenbk","tvasudev","cduong03","jjyim","loranbm","lamya26","olinw","timjing","calvinb4","gwk","jasleen"]},{"id":980190978,"topic":"gsc","slug":"jacobbenfordgsc","title":"Jacob Benford for Graduate Student Council (Law)","content":"","user":"jacoben","signees":["aewoods","aracelyv","ascohen","brimitt","jacoben","jacobr3","rdavis24"]},{"id":980191019,"topic":"ugs","slug":"miguel","title":"Miguel 4 Senate","content":"Hi everyone, \n\nI’m Miguel (he/him) and am currently a frosh running to be on the Undergraduate Senate! Coming from being a Frosh Council rep (Branner Hall) and being part of the Stanford ASSU SAP program, I have been introduced to many issues affecting the Stanford community. As a FLI student, I am passionate about making Stanford equitable and accessible. Reinforcing Title IX, increasing mental health resources, and providing more opportunities for FLI students are some of my goals I hope to accomplish. Finally, Stanford really needs fun so let’s make that happen together.\n\nLooking forward to serving you all. If you have more to add feel free to email me jmtejeda@stanford.edu or reach me on instagram @miguelltejedaa. Vote Miguel for ASSU Senate. ","user":"jmtejeda","signees":["nadiac","c8g","emme","callia","montagut","kmessai","gurmenb","diegok12","ashleyt7","gnalu","kevin26","balba","earteaga","sestra68","nsussman","mbosborn","judewolf","blokhina","sengthay","avatiff","vren","kcarido","nickbuck","iroman13","jmflynn","evageier","ceesa","hasan17","shpotter","wangeles","jamesu72","samdizon","tgilli","jgfoltz","ptvera","celewis","gsandman","jsduan","hummelta","dcureton","calderie","aili","kkar","tdarryl","glallen","rtati","adehmani","laithg","newsoms","dawn9","sebvas","amf22","bouvierr","ashleyv1","phoenixc","lcp26","pmw26","taralyn","ellaw","emarkar","vl18923","dhoop","orose","sbaldeon","palmer57","sheden","oshebala","fletch42","db6","jonahbg","rishi26","miradeb","sohrabh","dantrejo","ktm9632","jrpuri","lizamik","zaza3","willsh","aniketm","joefata","jmtejeda","nnrl","cabowd","yashm","chantal8","ziminq","pochoa1","sxdiaz","lauren28","aarquin","franalva","merveo","evashen3","jlopez04","grahamjo","owenjung","leemary","linkj","kenlal","ivypchen","jro26","kkhadavi","avnivats","rrazzak","epmeyers","daschl","andrewhz","jenayue","eliek","sschultz","jakeleon","pjdagsi","ramonjsr","vaughn01","apolisky","jamesp26","ards2004","lenamik1","cbfarcan"]},{"id":980190982,"topic":"ugs","slug":"isaac4assu","title":"Isaac for ASSU Senate","content":"Hi y’all! I’m Isaac Nehring and I’m running for Undergraduate Senate. My priorities are (1) increasing affordable transportation options around campus, (2) advocating for streamlined and expanded funding opportunities for campus-wide social events, and (3) enhancing communications from ASSU around programs and policies to improve connection to fellow students. I’m also running under the Lake Lag Forever Party (LLFP). My original home is Montana -- where we get shit done -- and I'm looking forward to working in ASSU to make some positive, tangible changes for our Stanford community at large. I hope these priorities have your vote!","user":"inehring","signees":["abaveja","abelfior","adehmani","adenb","agy","aili","aliyan","alt11","andrewxz","andyyt2","ange1ine","annacr","annase","antonioo","asmith26","avaace3","avabrown","avaelisa","averylm","ballhaus","bkamm","calderie","changtif","chavicoy","cye","cyeh2003","ddesir","dinarazi","djrullan","doueiriz","dsallis","dylanv26","eaavila","earteaga","ebeharry","elijahbw","elisepb","elnorman","emilyguo","erivas37","fishera","gedelin5","gracejxq","gsandman","gscarr","guck","gurmenb","gwk","hdoueiri","hujason","hunter04","idavis","ikeda1","iroman13","ivypchen","izabella","jasminev","jclark26","jennaali","katiehef","katsm","kimi1215","knlam","lawr3nce","leemary","lholiday","lorsm","makayla4","maxjcamp","melodyc9","mgavin","miggyjv","mweis2","nadiac","nathanjp","nharvey","nicolese","ntlim77","okonkwo","olinw","paolagd","pkiernan","porsche","ranab","rohanac","rshreya","rzwet","saniss","sestra68","shaedol","sherylh","shreya77","sidnr0se","sokserey","sophiesz","sowmyac","sschultz","ssylvain","tdarryl","titus000","torred","vberm","viviansm","wberr","weshicks","yaraeli","yifechen","yuvrajb","zoecm"]},{"id":980190983,"topic":"class_pres1","slug":"winningteam","title":"Elect Natalie, Anya, Eric \u0026 Alyna for Sophomore class presidents!","content":"Our Team:\nNatalie Shell (Lantana), Anya Zhang (Schiff), Eric Heng (Larkin) and Alyna Lu (Donner)!","user":"natalie1","signees":["sarahjd","natalie1","elkinm27","nchi1","carowei","onyie","xrussell","dayal","sophiemg","ananyaud","kaitlyn5","mbosborn","hashash","aekpootu","acarrnza","rmabdull","jnfong","vren","stefzoz","sanant","alynalu","adibsood","langaney","michpark","jsiskind","avi04","ptvera","ashley22","gmontes","tytzhang","arzola26","gsandman","aadisaha","jkong2","calderie","mirawan","kkar","kghosh04","glallen","egreyson","gerwin08","andrewrk","aszhou04","zoecm","abaveja","hongmeng","kjdhir","akemisab","kushalt","leah26","niklasv","mohar","yujina","idavis","sek27","jle7","aayush2","jonahbg","qam","meganp22","jwnorth","sdliu","evyshen","aadityap","jacalbr","clairkoo","asazi","rnarain7","lcarolyn","kathli","alexhliu","louisely","sherylh","etardif","juik","mehmett","elijahs2","hujason","samgupta","auday","pxye","vsaravan","erinye","ramya1","tracywei","sakshiu","jhuang23","lindh179","che0chen","rohanpar","jyxzhang","alexyans","devgupta","leegarg","shreyas2","vjansari","ericheng","azguo","ivange","dhruvpai","meiligp","jennywei","ishanim","alexra24","alicezhu","epmeyers","wangandy","bowen07","kmayu","jdgrayso","willnb","lethu","atkehm","ajadhav","zlakkis","ranataki","xhou","dkavi","clairez","ethanz","cceleste","anyazh","maimunam","vson","alixf","htodorov","jjyim","mding26","colinmck","siyagoel","jjxue1","emily712","vnaga","jchen04","timjing","ishritap","evansing"]},{"id":980190985,"topic":"gsc","slug":"tomliu","title":"Tom Liu for GSC Rep (Natural Sciences)","content":"I have been active in advocating for graduate students all across Stanford both with the Stanford Solidarity Network and by serving as the president of the Graduate Students of Applied Physics and Physics.  I want to continuing making Stanford a better place for all of us. After seeing everything the GSC has accomplished recently, I feel that is where my efforts will be the most useful in the coming year. Thank you for your support.","user":"liuto","signees":["aghrist","atbreid","bried","erpark","eschell","esoroka","gbasel","jand271","jierui","jjy","joswong","kailiang","kcarp","krapivin","kwhatley","mbolivas","mcshea","mdx","mhorst","mihayes","mjaarte","rafimah","rodwyer","samswong","scree","sdortega","tami","toledano","vkm"]},{"id":980190996,"topic":"gsc","slug":"skavya","title":"Kavya Sreedhar for GSC","content":"Hi everyone, I’m a fourth-year electrical engineering PhD Student and am running to be re-elected as a School of Engineering Representative on the GSC. This year, I am serving as one of the two Social Co-Chairs on the GSC, a graduate student representative on the Committee on Graduate Studies (C-GS), and the graduate student representative on the Joint C-GS and C-USP Subcommittee providing recommendations to the Faculty Senate on how to adjust the academic calendar so that the first day of school does not coincide with major Jewish holidays.\n\nThrough my role on the GSC, I have hosted about ten events each quarter along with my Social Co-Chair, Leslie Luqueño. These events have ranged from on-campus dinners and movie nights to off-campus events at opening night for movies at Cinemark theaters and a San Jose Sharks match to heavily subsidizied tickets to TopGolf and Enchant Christmas nearby in San Jose. With these events, my main goals have been to provide regular accessible opportunities for graduate students to get back what they pay for in their student activities fee every quarter, build community among graduate students and facilitate interactions between students in different schools and programs, and provide frequent opportunities for graduate students to interact with their GSC representatives to voice questions and concerns they have so that the GSC can better represent the diverse opinions and concerns of the graduate student body instead of solely the smaller sample sizes of communities GSC representatives are part of. To that end, most of our events are free, are either hosted on campus or include free transportation if an event if off-campus, and allow for at least a plus-one if not as many guests as a graduate student would like to invite so that students can enjoy events with their families and friends. Through my role on the GSC, I have worked to define event policies and build sustainable social event infrastructure and documentation with Leslie (which was very sparse due to the lack of social events during the pandemic), further increase the awareness of the GSC on campus and facilitate connecting students to their representatives so we are truly representing the graduate student body, and effectively communicate and follow up on questions and concerns from graduate students.\n\nThrough my role on C-GS, I have been involved in discussions on academic calendar changes to ensure that we avoid the first day of school conflicting with Jewish holidays, which led to the formation of a Joint C-GS and C-USP committee specifically looking at academic calendar changes. My goal when serving as a representative is to actively and regularly solicit feedback from undergraduate and graduate students from diverse backgrounds to provide more than my personal perspective at these meetings. It is through these interactions that I learned that not only is there a desire to be respectful of Jewish holidays, but students also mentioned that there are other non-Jewish holidays, such as Chinese New Year and Diwali, that regularly conflict with midterms and finals weeks and asked if accommodations could be more broadly considered. Bringing up these issues to these committees connected myself and the GSC to offices on campus such as the Office for Religious \u0026 Spiritual Life working on a broader discussion on accommodating students for religious holidays more generally and I am communicating the feedback I have received from students to share broader student perspectives in such conversations. This effort is an example of my broader goal to ensure that the perspective that student representatives share with these committees as they make decisions and policy for the university is more reflective of the diverse perspectives and experiences on campus. By actively bringing up these conversations during GSC meetings, I am able to get feedback from representatives from all the schools at Stanford and provide a well-rounded perspective.\n\nI would be really excited to continue serving on the GSC as a Social Co-Chair or one of the overall GSC Co-Chairs next year to advocate for graduate students at Stanford. From my time at Stanford, I am passionate about supporting and representing students who live off-campus (as I have now lived off-campus for three years after living for two quarters on campus right before Covid) and providing regular accessible opportunities to form graduate student community (especially post-pandemic) and connect GSC representatives with the broader graduate student body. Thank you for considering!\n\nCheers,\nKavya","user":"skavya","signees":["erpark","eschell","jand271","lluqueno","skavya","toledano","xtchang"]},{"id":980190997,"topic":"ugs","slug":"amadoforclubsports","title":"Put Amado Shrestha and club sports on  ASSU ballot ","content":"I am running for the Undergraduate Senate because I believe that student life has already faced enough challenges, and cutting club sports will only make things worse. The ASSU needs to prioritize student life and avoid creating a situation where only wealthy students can participate in sports that require funding. ","user":"amados","signees":["bakers","aadwash","krainc","kianahu","isat","meking29","jolah","alexloia","emmapass","elowet24","jdc0405","wcoors","fbg","cjikeda","jchen465","sstev8","francis6","ychen23","aaronli9","kleahy23","kge","alice27","mjk3","bkuglen","isarrigo","ffbdair","ksesben","gatesr","cath24","isaeich","zincoop","evajones","afnaan","jmarsal","sophiahc","hannahoo","krjavins","bpatrick","ryin0","sophois1","alyndm","bella17","kpodosin","gurmenb","anikaq","lmckhann","wksfdm","evagoren","csun7","samgb","lwca","sagems","aebunch","nsmejia","akrosten","novialiu","lholiday","wsayler","lskaling","dangold","rshreya","kjolly","kdelg88","raymondd","willzli","belloy","alexzhai","jkraus","andman","dpichay","jolenel","pizarro","osibal","sestra68","noellea","parthiv","sachino","hcussen","mueland","ornella","ccahilly","isagxd","acarrnza","piperf","fishera","snbloom","smacharg","igmalik","ekamas","matthtan","gvadmal","colinrs","cgmartin","ceesa","efilipek","arjvik","hasan17","ftantawy","zteplin","rmorelos","majohns3","amados","senkaih","torred","calderie","tdarryl","bella06","elijahk","cam4567","hsantos","afishpez","mreisner","brdel","katiegl","richchen","zoecm","kaif","idavis","abelfior","shevyip","avabrown","etardif","henrys1","cbeamer","ivypchen","wangandy","rranjan1","ishritap","nickcamp","wgolub","grane","edoyin"]},{"id":980190986,"topic":"exec","slug":"amiraadenforexec","title":"Amira Dehmani and Aden Beyene for ASSU Executives","content":"HELLO EVERYONE!\n #Amira\u0026Aden\n\nWe are Amira Dehmani (she/her) and Aden Beyene [she/her] and we hope to be your next ASSU Executives! Our platform surrounds four pillars:\n\nStudent Health \u0026 Wellbeing ~ Accessiblity ~ Student Life ~ Graduate Student Outreach\n\nWe are both juniors who have served on the Undergraduate Senate since 2021. We currently serve as the Co-Chairs of the 24th Undergraduate Senate, spearheading this year’s initiatives to bring back the Margurite N \u0026 O lines, create a mental health crisis response team, establish a multi-racial community center, address sexual violence on campus, and more. We bring experience, we bring institutional knowledge, and we are passionate to continue this work as ASSU Executives!\n\nFrom Frosh Council representatives to UGS Parliamentarian and Deputy Communications Chair to UGS Co-Chairs, we have worked together during our time at Stanford to better our community. We are proud of the strides we have made thus far, and if given the opportunity, we hope to champion change as your ASSU Executives. Our platform statement is available here, though we ask that throughout the campaign period, students share their concerns with us at this link so we can work together to make Stanford a better place for us all.\n\nWe hope you will support us by signing this petition and sharing with your peers! Follow us along on the campaign journey at our Instagram account (@amira_aden_for_exec).\n\nWith Love,\nAmira \u0026 Aden","user":"adehmani","signees":["lforman2","mccorrea","miaschau","yanmin","mtillery","natalie1","tkanell","jsr2022","lzfowler","jianyuq","sagehs","dwendt","asiwiec","kagould","lindenli","gmcrooks","garethc","hsdow","daania","zgawish","racheriv","allan300","gandara","drockett","rashid","btf","canmai","mkphan","ebenitez","vinhhuy","ty1","xavier24","timmy4","jbrivkin","bschmo","awalley","nssantos","tsonia20","eboone24","mayoob","jaraujo","buenarte","sloanc24","eviechen","scsharon","karencho","ffbdair","icarinaf","nitarac","iskalia","mjacquez","solomon3","gaustinb","jannahkv","skamni","ayushjk8","tishrei","kenen","cnwamu","mohitn","bryanta1","anance","vjonuoha","nmullins","mtmosley","huynha","yousifm","yqazi27","ashiravi","sadorian","erikrozi","brsharma","hctaylor","laswopes","leopoldv","jvedelli","acwaterf","sophchun","nsariowa","mwirtz","samia884","abochner","camadams","sunur","melannyg","osose","gabbyrbh","odeyindm","janay17","pillutla","shrestp","lcarlin","akps","nbabar","samthapa","jscala20","adenb","jmo101","anniema6","kpodosin","kgyang","priscirs","yoon0215","gurmenb","ajlynch","aechano","janenek","malinac","gdimop","nhagos","ishaanks","diegok12","dmacfar","ashleyt7","jenkin02","rajmera","skrish24","colan02","bl031520","kterrell","rosa2024","rmgarg","ianzabi","mausmani","kallielv","lsq245","kmducre1","nkemobi","e2morris","ericz27","tdavi","mollyeg","mbenyas","spenglas","phongngu","kristyc","lbailey1","nicortes","mtsosi21","gskbagga","mmurra","rishirv","kayshen","rshreya","mchhay","lmadril","sassog25","lilavdb","lishan","onyie","obaid3","aewoods","sdsam","rmjiang","camilafm","pronisvh","slangevi","sriyam25","dsallis","ivanjj","jmolloy","asanyal","zhanf","sarahrm","tegirard","cmcasey","gregkal","osibal","diegogtz","karen330","sophiemg","narment2","djcald04","wang1080","katiesav","sestra68","ananyaud","upadhyar","leilades","makayla4","sengthay","brivira","eebssa","kylaguru","malayeri","jsotelo","rmabdull","kpashin","rjpizzit","gracekt","avatiff","jnfong","sackey","jiajuliu","vren","cnicks13","araomit","josie25","vivian24","aliceku","pritir","sophiesz","alvajosh","hokj27","cathyhou","nsala","iroman13","sherryl","wynnkhe","tmars","cehsan","hasan17","mgoodson","alyssamu","akhawaja","rcastane","mina1317","aluffman","huertam","elijahbw","sarairv","maxjcamp","eorozco","amallott","cmaximos","gmontes","truccam","lsalaz","jw20","maixee","bristueb","hummelta","gholzer","ehadar37","mm28","kramerrr","alainp23","calderie","inehring","agmsharp","mirawan","kkar","daisywyh","tdarryl","glallen","rtati","elakew","zcs2024","alinadav","adehmani","jkorth","sfitz12","gabbytan","sutyazz","zoecm","lhasunci","hongmeng","dawn9","mkorish","mircheng","leah26","massiel","jle7","abloom49","sidnr0se","evyshen","jessnoel","asazi","jtikare","jmtejeda","emblem","tatesgar","jasagye","zoyanf","jyxzhang","mayamk","ekkno","leegarg","chrstnk","willyli","alicezhu","lsosnick","jdgrayso","serac","ajadhav","zlakkis","zasemota","ellarh","clairez","sschultz","alixf","tyanlee","avajeffs","lamya26","jiggy56","ndye26","marsoner","llouis9","akary","gwk","avadecon","jas1016","mcerepi","tzivre","bbyan"]},{"id":980190988,"topic":"ugs","slug":"senatoraqib","title":"Vote Aqib for Senate!","content":"Hi everyone :)\nWhen im not cheering on our Stanford basketball teams or leading my frosh 101 section or working with the Muslim Student Union to plan events and conferences, I'm probably working on psets or concocting ways to make the reforms that will improve this university. No more inaction and thinking; im running to implement the changes I know we need.\n\nI love this school and I call Stanford home, but I've noticed some things that Stanford, particularly the Senate, must improve. I'm a firm believer that if you see something wrong, you need to fix it, and that's exactly what I will do. Some of the areas I will focus on include: bolstering student life, working to expand funding for minority and low-income focused student organizations, increasing mental health access and resources, increasing insurance accessibility and disability accommodations, as well as increasing student and staff workers' compensation and benefits. I am committed to all these areas, and I will act to implement so many more changes.\n\nI want to improve this school because I love this place. Sign my petition so I am able to implement the changes you want to see.","user":"aqib","signees":["mahmoodj","blwhite","noelseo","lalkhani","skonar","jianyuq","leealex","jseiba","josue23","rawwad","ahoag","rashid","svahan","rafeea","nkrut123","cdcott","drico","thaneb","ffbdair","gcomas","emilyc02","ankushd","icarinaf","jaxfloyd","iskalia","gaustinb","arnavk","anwesham","yqazi27","aminsajj","ore","itbaan10","jtaha","rileywp","benitezb","jdrod","shrestp","samthapa","kgyang","gurmenb","abenmira","mausmani","malisha6","aryan22","mseng","nhass","nkemobi","johnl25","zkim03","mnath","samgb","jswahby","yousef24","hamidou","luomei","bbui","elasigin","marslani","sejoon","aabd","espeng","brentju","vrishab","adamhus","rshreya","kendalm","benky","rminocha","calebb","shgnatow","afaruk","kevin25m","ikmardin","smjacob","asurana","zzafran","icooper","jabarca","mothana","hiyashah","cfsan86","sidshr","gregkal","bmendezm","sestra68","hussamig","wali","sazzad14","rmabdull","oekeagwu","abyellow","aldr","amescher","nsala","yanav","arjun25","yasserj","adadamio","hasan17","hrg","hpalmer","kahn94","aqib","ajpat","miggyjv","ehadar37","calderie","marcoas","tdarryl","glallen","aayanp21","benefarr","mohamed8","beradem","niam","ayaan26","anushkav","usahn","samshors","ivypchen","sayed","kkhadavi","ajadhav","sjavvaji","ihsaan","nourmary","dzawa"]},{"id":980190998,"topic":"ugs","slug":"diego4senate","title":"Re-Elect Diego Kagurabadza for Senate","content":"Hey! My name is Diego Kagurabadza (he/him). I’m a sophomore studying American Studies and Political Science. As the Parliamentarian of the current Undergraduate Senate, I am running for re-election to continue the work begun this year!\n\nMy advocacy on the Senate focused on affordability. Particularly, I led efforts to reduce or eliminate course-required textbook costs. Our student survey revealed troubling data on the affordability of books and inspired a unanimous resolution urging professors and academic departments to provide these resources for free. This advocacy secured my proudest accomplishment: a $4,500 purchase of textbooks to be made publicly available at the FLI Library!\n\nBeyond this effort, I have also supported the installation of comprehensive safety measures to address sexual assault on campus, as well as the return of the Marguerite Palo Alto and Shopping Express Lines. I have also sought to expand student representation on the Senate with the addition of Frosh and transfer members. Plus, I chaired the Senate’s Board of Judicial Affairs Committee, meeting weekly with University representatives in the fall to recommend reforms to the Honor Code and Fundamental Standard.\n\nAs a returning member, I hope to provide institutional knowledge to the new class of Senators. I also hope to continue the push for student affordability, which has been my primary motivation. This involves further collaboration with academic departments to find alternatives to required textbooks and online access codes. It also means work with University administrators to ensure equitable access to services like the Marguerite and even CAPS.\n\nFor these reasons, I hope you’ll consider supporting my campaign! Vote Diego for Senate!\n\n[Image]","user":"diegok12","signees":["miaschau","asukulu","mtillery","nick1019","tkanell","sarahyri","mbozeman","ecyfemi","brand23","allan300","drockett","vazquezf","sdeb7","gmesa","preidl","mjperez","xlorenzo","jlim223","aallen02","geanamm","klaraat","jaraujo","buenarte","bbrem","iskalia","mjacquez","gaustinb","mariogn","ojessner","tristynt","changrc","osose","shrestp","hywot","adenb","gurmenb","ndomingo","nneomau","rhodest","ishaanks","hailey24","fabianv","rbraz","kallielv","meseretb","hawe","kaylacol","amayam","sadio","hdwill","jazmins","ntan1016","lukeveit","sydneymk","lindav","phongngu","eapple25","ibrahim3","hgris","kisemben","lholiday","guyemura","rishirv","fbari","rshreya","ayad38","marasolo","lishan","daphnehl","rkacham","lorapv","egwright","isaiahf","robz","jantorr","jaylatay","mcruz55","esu02","sdsam","paradin1","listella","wrose03","crysbern","ndorame","cwenardy","pronisvh","reddysh","jmolloy","asanyal","dpichay","cfsan86","gregkal","diegogtz","sestra68","sbenabou","brivira","jsotelo","crollock","josie25","rchor","huilanh","sophiesz","alvajosh","ducdinh","iroman13","ananya03","wynnkhe","selaine","tawosile","varanda","hasan17","gabefm","alyssamu","nhupham","mina1317","huertam","elijahbw","eorozco","gholzer","calderie","daisywyh","tdarryl","glallen","rtati","yabraham","adehmani","afajardo","wmusyoki","ngualexa","jmtejeda","sachinss","antonioo","tuffourv","lindatrn","kenlal","ivypchen","canthon2","nneoman","jsusant"]},{"id":980190999,"topic":"ugs","slug":"joy4senate","title":"Re-elect Joy 4 Senate","content":"Hi everyone,\n\nI’m Joy and I am a sophomore running to be re-elected to the Undergraduate Senate. During my current term as a senator, I was elected to be the Communications Committee Chair. Through this role, my team and I have revamped the UGS’ social media pages and we created all of the amazing graphics you see on our Instagram page (@assusenate). Not only that, but as Communications Chair, my team and I have sent out multiple newsletters per quarter to update the student body on advocacy areas and initiatives our senators are working on. Coming into this role, I knew that the senate could utilize social media as a means to better reach and connect with Stanford students across all years and I hope to continue the work I have already started by being elected to be on the UGS again. \n\nIf re-elected, I will continue to advocate for FLI students to have better access to on-campus academic resources such as CTL. As a current undergraduate senator, I am currently collaborating with CTL to understand what reforms can be made to make tutoring more accessible for FLI students in particular. Being re-elected will offer me the opportunity to continue advocating for more academic accessibility. During my current term on the senate, I also served on the BJA \u0026 C12 committee where we helped amend the Honor Code and Fundamental Standard according to student concerns and I hope to continue this work. \n\nNot only that, but if reelected, I will continue to be a voice for all students, and make the needs of historically marginalized groups heard. Being a student of Caribbean descent gives me a unique insight into the struggles and wants of students whose needs have been historically ignored and trivialized. I plan to use all of the leadership skills I have learned from being on Frosh Council as well as my first-term being a senator to be an effective beacon for change. Bring joy into your 2023-2024 school year by voting Joy for Senate!\n\n~Joy Molloy\n\n[Image]","user":"jmolloy","signees":["lianeozo","tuananh8","lforman2","miaschau","eboomer","winsonc","asukulu","mtillery","nick1019","dsarraf","drockett","ctravier","xlorenzo","aallen02","gaustinb","achan51","caylaw","shrestp","adenb","gurmenb","rdlg","nneomau","ishaanks","diegok12","rbraz","christyz","meseretb","hawe","kmducre1","amayam","sadio","hdwill","fathuma6","nkemobi","nasemota","afuloria","faithaja","cemodi25","eapple25","sabaw","hclay116","nkdupree","blue25c","kskuo","amarcum","lholiday","hgetahun","dthlang","aadinash","scottvu","no6279","rshreya","annag25","jaesobs7","zoeyhill","jalilc","savahnap","viyan","epifants","obrown1","mahleta","mkalu","leo3","lmohamad","jaylatay","mcruz55","arusha","sdsam","paradin1","rmjiang","crysbern","joannedp","oripova","analiese","myrka","dsallis","asanyal","howra","solmihk","cfsan86","sylc","lac0306","jasoncl","diegogtz","sestra68","estewu","ayanag","sachino","guck","brivira","eebssa","av200306","jwv","nomin","josie25","aliceku","alvajosh","pmnoerto","miacano","nsala","iroman13","ananya03","tawosile","hasan17","shaedol","ipassos","zarahsan","huertam","allysaw","meganmou","cmaximos","jwhilby","aew0114","cdlr","avayun","gholzer","calderie","tdarryl","glallen","rtati","benefarr","yabraham","adehmani","biswala","ssruthi","dawn9","alxzhang","ckenz","jclark26","jmtejeda","ivypchen","ndhieu","nware4","oziegler"]},{"id":980191000,"topic":"ugs","slug":"gordonforsenate","title":"Gordon Allen for ASSU Senate","content":"Gordon Allen for Senate!\n\nVote Gordon Allen (he/him) for ASSU Senate! Gordon is a FLI student who matched to Stanford University via the QuestBridge National College Match. Gordon is part of numerous student groups on campus: Stanford ASSU SAP, Neighborhood R Council, Black Student Union (intern), Blyth Fund (analyst), Ujamaa Dorm Gov, Stanford Finance, and more.\n\nGordon has a prominent background in youth activism. Gordon has co-led and participated in numerous social activism campaigns, such as for sexual violence awareness, abortion rights, LGBTQ+ rights, DACA youth rights, and more! Gordon has worked with the board of education to address mental health, student and staff wellness, and restorative justice across grade levels back in his home community.\n\nGordon strives to help Stanford become a beacon of inclusion, security, resourcefulness, and community. Gordon will do this by sponsoring and advocating for policies that seek to promote opportunity and resources for multicultural and FLI communities, as well as policies that ensure that administration holds those accountable that have sought to cause discomfort and division in campus spaces.\n\nVote Gordon Allen for ASSU Senate if you want a leader that is driven and ambitious to ensure that his community’s needs are prioritized and answered! \n\nFollow his Instagram to stay updated: @gordonlallen \n\nFor any inquiries, feel free to DM Gordon or email him at glallen@stanford.edu\n\n[EFF5B54C-0CEC-4E56-90C6-D846F9ACE906.jpeg]","user":"glallen","signees":["tjp2608","asukulu","egurwitz","sdebesai","isaiahd","nharvey","natalie1","niasm","jmfinley","dija","njohn25","lslawson","owas2301","ashaj","vflowers","canmai","ty1","aallen02","geanamm","rahsaan","bbrem","mariogn","janay17","adenb","cmvan","devgreen","gurmenb","nneomau","diegok12","ashleyt7","bl031520","meseretb","amayam","hdwill","z050821","nkemobi","sydneym","faithaja","eapple25","sabaw","nkdupree","kismail","kano","llampley","lishan","iyanu","cmgbahur","egwright","anmcarty","meganl","jaylatay","jazgonz","krc2003","ndorame","pjasmine","jmolloy","cfsan86","gregkal","nhtran","diegogtz","jonwill","fonsecaj","djcald04","cordovam","earteaga","sestra68","ayanag","efeleke","judewolf","guck","sengthay","lernest","amendoz1","rmabdull","gracekt","ncanad24","avatiff","natalyal","gpolite","crollock","alynalu","araomit","kimi1215","miclop16","sorianod","josie25","gtsion17","cjcang","huilanh","zmouza","abeldag","alvajosh","rmoseley","talharao","dswinton","mromain","nickbuck","markrc04","iroman13","connormj","wynnkhe","tmars","cwcthree","tawosile","hasan17","ftantawy","shaedol","greta30","amdedios","daphyu20","jamesu72","aqib","patwei","emiliofr","vporto26","elijahbw","maxjcamp","ptvera","dinarazi","amiri03","jwhilby","aew0114","gmart8","gmontes","bmeneses","rjsouth","calderie","elizafs","okonkwo","tdarryl","rtati","benefarr","yabraham","sayp","cesy04","kaylaw17","mamoah","scottyed","bless","renee128","dawn9","armitahj","crkang","rdshetty","tsnoey","nsdb","krclarke","idavis","skasi","henakhan","sarahlst","oshebala","ddesir","alonzia1","ngumel12","jsib0705","rchiek","whittj","ngellis8","mweis2","ngualexa","jaylonj","jules109","hangan","jtikare","jmtejeda","isaackan","nneka","izzyip","oroti","agrawald","joewar","gxsoto","mclewis1","tuffourv","comcbeth","zhane04","astha26","jasagye","liannec","ivypchen","amsal","skpritch","sbohles","kkhadavi","mkc3399","dadenuga","anyazh","emiyare","dwiley26","akonig45","logreen","husna","thardy74","cduong03","jasgosal","avc26","tolani26","pacheco7","llouis9","sadira","luke2004","akary","jarren","gwk","emokine"]},{"id":980191010,"topic":"ugs","slug":"edenforsenate","title":"Vote Eden for Senate!","content":"Hi everyone! My name’s Eden, and I am running for undergraduate student. I am a current frosh originally from Los Angeles, but I have also lived in Israel. On campus, you will likely find me hyping up Hillel events, or exploring the beauty of Main Quad; but beyond that, I’m also a member of the Lantana Dorm Gov, Stanford in Government, and Stanford Synapse.\n\nAs an institution, Stanford does a lot to support us as students. Nevertheless, it has its shortcomings, which I am passionate about using my capabilities to address. Some of my big focuses will be improving mental health resources both within and beyond CAPS, advocating for accessible dining options on weekends that accept cardinal dollars, and ensuring religious minorities have resources to feel safe on campus. \n\nMore generally, I hope to serve as a liaison between undergraduate students and Stanford administration to improve overall student life and wellbeing. If this sounds promising to you, please sign this petition :) And feel free to reach out for any questions: my email is ehadar37@stanford.edu\n\nVote Eden for ASSU senate!\n\nBest, \nEden Hadar","user":"ehadar37","signees":["acolli","adehmani","andman","anushad","aqib","arzola26","bkinder","bristueb","calderie","cmaximos","crkang","diegok12","ehadar37","gaustinb","hayab","hongmeng","iacohen","iszabo","izzyip","janay17","jaslew03","kellydan","kkar","kpashin","kramerrr","lauren04","leegarg","mirawan","nsariowa","rdshetty","samarium","sestra68","sherryl","sophiagd","sophiemg","sophiesz","tdarryl"]},{"id":980191001,"topic":"ugs","slug":"tatiforsenate","title":"Re-Elect Ritwik Tati for Undergraduate Senate","content":"Hi everyone! My name is Ritwik Tati and I’m extremely excited to seek re-election for the Undergraduate Senate. This year, I’ve had the pleasure of serving as Deputy Chair of the Undergraduate Senate, running the Senate Associate Program, and accomplishing a variety of the goals outlined in last year’s platform. As a FLI student, I am deeply passionate about equity, accessibility, and accountability across all aspects of student life. Below are just a couple of notable accomplishments that came out of my term:\n\n• Implementing free basic needs, menstrual, and sanitary products across campus in all public restrooms\n• Amplified solutions for sexual violence concerns related to public safety, faculty accountability, and Title IX reinforcement\n• Calling upon the Stanford University Department of Public Safety (SUDPS) to review and reform its de-escalation and anti-bias procedures\n• Co-advocating for the re-implementation of the N\u0026O late-night lines of the Marguerite\n• Teaching and mentoring 35+ freshmen and sophomores about student government at Stanford\n• And more!\n\n\nThis proven track record of advocacy is a step forward, but there are other issues affecting students on a daily basis. My platform details routes of advocacy for these other pressing issues. Through all of this, YOUR voice is what matters the most. I will make a commitment throughout this election season to host weekly office hours (8 PM on Thursdays!) and tabling events to hear what YOU have to say. If you’d like to submit anonymous feedback or cannot make it to one of the scheduled events, you are more than welcome to share your thoughts via this form. \n\nAll links above will fall under linktr.ee/tati4senate. Keep up with platform updates, campaign events, and more @tati4senate on Instagram. I hope to have your vote!\n\n[Tati4Senate Squares.png]","user":"rtati","signees":["abigailn","achen16","adehmani","adenb","adyant","agrawald","ajuv","akrosten","alamy","albertjh","anavib","anwesham","ari17","arjunj","arushig","avadecon","benefarr","bjsnyder","bnatasha","briannaf","brivira","calderie","cfsan86","chehan","ckenz","crkang","diegok12","dsallis","dsarraf","dthlang","earteaga","egms","egwright","emackay","emmwang","evajones","gaustinb","gholzer","glallen","hasan17","huertam","ikmiller","ikrement","isapista","ishaanks","itchen","ivanjj","ivypchen","jiajuliu","jmolloy","jmtejeda","joshia","josie25","kaitcs","karencho","kathwoo","khusbua","kjavi","kkhadavi","kumarvig","kvseet17","lcarlin","lforman2","lishan","listella","lizbethz","malayeri","maya3ac","mbedge","mcolborn","melinaos","miaschau","mjacquez","mtillery","nagarcia","nkemobi","nmdavis","nsala","oziegler","pronisvh","reddysh","rishirv","ritikak","rjpizzit","rkacham","rmlit","robz","rshreya","rtati","savahnap","scottvu","sestra68","shrestp","shsu8","skonar","svahan","svardaan","tdarryl","tjehl","vedakan","veenaa26","vinhhuy","zhanf"]},{"id":980190995,"topic":"ugs","slug":"ronnyforsenate","title":"Ronny for Senate","content":"Hi everyone, My name is Ronny Abdullah. I am a first-gen frosh from Detroit and I'm interested in running for the role of Class Senator. As a passionate and dedicated member of our community, I am committed to fighting for the needs and interests of my classmates. I think that my unique abilities and experiences make me an excellent candidate for this role. I am an active member of many clubs and groups, including the Muslim Student Union, and the Stanford Brain-Computer Interface. In addition, I am extremely devoted to community service and have worked with a variety of non-profit organizations to enhance the lives of people in need.\n\nAs a Class Senator, I will work tirelessly to ensure that the voices of my fellow classmates are heard and that their needs are met. I am committed to promoting diversity and inclusion, supporting academic excellence, and enhancing the overall student experience. Whether it is advocating for better mental health services, addressing issues of campus safety, or promoting sustainability initiatives, I am ready to take on any challenge. I understand that this role requires a significant amount of responsibility, and I am prepared to dedicate myself fully to the position. I promise to work collaboratively with my fellow senators, university officials, and student organizations to achieve our common goals.","user":"rmabdull","signees":["acolli","adehmani","agliang","alanaesp","alexi26","amelie9","annelic","ansarin","aqib","arabof08","araomit","ashantin","ashleynm","atkehm","avi04","az1","bamaro","bbrown4","bennettb","beradem","bigsean","bless","bnkwa03","calderie","cduong03","celinach","cfsan86","davfox","dbruce","doueiriz","earteaga","efa2003","efeleke","ehc001","erinye","ezzat","ffbdair","glallen","gracekt","gsantac","hasan17","hmunoz","hsosa","hussamig","hvoorhis","ihsaan","inafi","isaacdg","ivypchen","jasagye","jasleen","jaslew03","jdgrayso","jkolah","jnfong","jsduan","jtikare","jzhou8","kasha","kasn","kellysb","kfeinst","kmadhav2","krwang11","lalkhani","lamya26","langaney","lhester","lilaanne","lisaing","lsosnick","luis1031","mbosborn","mhamdi42","mikesun","muhsihsi","narment2","natalie1","ngellis8","ngumel12","niam","omfarkas","oreyes1","ovq27","owenjung","plengk","rashid","rcarolan","rchor","rishi26","rmabdull","rmorelos","ronhafez","rshreya","rypark","sayed","sazzad14","selaine","sestra68","sfaux","shunueno","skamni","suahmed","taman21","taylor25","tdarryl","tmars","tracywei","yousef24","yqazi27","yupar26","zgawish","zzreik"]},{"id":980191003,"topic":"ugs","slug":"dgforsenate","title":"DIVYA G FOR SENATE","content":"It's simple really: Stanford needs fun. Stanford needs accessibility. Stanford needs a voice. Coming at you with Frosh Council and Cabinet experience I'm ready to serve. Vote Divya G for ASSU Senate. ","user":"dganesan","signees":["xanderh","adibora","noelseo","jianyuq","amanm27","jsingh5","katluru","tgivens","svahan","parthav","cagraham","sohaylae","xlorenzo","jlin74","j21ls","klaraat","taulakh","oliviabb","mjacquez","alexmm","rheamal","cvlim","neelsn","anwesham","linds8","kls2024","aydhall","cmluong","akps","npatel12","esandell","gurmenb","anikaq","ltoure24","mbrock03","swondsen","astoker","akbrandt","anniezhu","nyah","ananyasr","dkutz","rohanc12","ariarias","ebarrosa","bfelix","zoyagarg","arturok","safseck","kevinaw","scottvu","mathenyr","rshreya","layalkaz","benky","jeremybm","zoeyhill","wwyoung","anushkad","udvattam","cava","arialee","brianx","tobey","aselwyn","aworley","kealiav","etianshi","pnsahoo","ivanjj","jmolloy","sarahyao","cfsan86","sidshr","gregkal","sestra68","riyakaru","hferg","upadhyar","mnditt","brivira","kylaguru","lmbotin","nagarcia","ddl","yarencya","rjmoore1","smacharg","kvwong","avakerk","hasan17","alyssamu","sophiagd","jamesu72","hhhwang","huertam","tgilli","adeloera","alexlee3","sathvikn","calderie","laurynf","tdarryl","ngoodwil","tedhick","adehmani","afishpez","ashah24","ngmurphy","rowens","jcos","lucyrose","jmtejeda","ivypchen","avnivats","shuster","czhang7","rlspence","oziegler"]},{"id":980191011,"topic":"ugs","slug":"jamesforsenate","title":"Vote James Ubi for Senate","content":"Hey everyone, my name is James Ubi (he/him) and I am running to be your undergraduate senator. A little bit about me is that I am a low-income student, I'm from Staten Island (NYC), and I am hoping to pursue a major in American Studies. \n \nWhen coming to Stanford, I had very high expectations of what a college like this would be like, some of which fell short. Which is why I’m running to be your senator. Our school, unfortunately, has been lacking in adequate mental health programs, responses to harassment and assault, and has lacked funding for FLI (First Generation/ Low Income) students which has created unnecessary hardships. Therefore, I hope to address these problems and more as your representative, as well as issues the students of our class would like to advocate upon.\n \nWithin high school, I spent my time advocating for minority communities within my predominantly white school. I participated in Key Club where I volunteered to help low-income communities across Staten Island. Additionally, I worked for the American Foundation for Suicide Prevention, which advocated for mental health awareness especially within schools.\nFinally, I participated in student government as well as my borough's student government,  where I focused on student activities and fighting for a more diverse and inclusive education within high schools.\n\nOverall, I hope to continue this work as YOUR senate representative, ensuring we have the means, the funding, and the support to pursue our passions during our time at Stanford.\n \nFeel free to reach out to me on Instagram @james_ubii or  jamesu72@stanford.edu, I look forward to hearing more about our undergraduate students perspectives!\n \nP.S I work at Starbucks, so if you see me feel free to say hi and talk about what matters to you!\n \n \n \n \n \n ","user":"jamesu72","signees":["zachlin","mtillery","eaavila","xlorenzo","jflores1","gaustinb","gurmenb","diegok12","ani258","jrbahk","alexzhai","gregkal","karen330","sophiemg","balba","djcald04","cordovam","valbanez","earteaga","sestra68","lenaxvii","guck","sengthay","rmabdull","gracekt","vren","alanaesp","miclop16","jsnl","abyellow","nancys03","markrc04","iroman13","evageier","hasan17","ftantawy","trsnyder","camadon","mduffy8","lesley03","daphyu20","wangeles","jamesu72","bamaro","ptvera","chiaras","aew0114","gmontes","hmunoz","kasn","celewis","dcureton","kramerrr","lkerner","calderie","juansd","agmsharp","aili","kkar","tdarryl","glallen","mamoah","adehmani","iszabo","gflynn22","taylormf","dawn9","rowens","sebvas","leah26","emoore26","massiel","sbaldeon","krclarke","sek27","kmw1217","oshebala","jonahbg","maya31","bdono","ngellis8","lucyrose","catbui","slee93","mweis2","ngualexa","sydbarta","jules109","jmtejeda","danign","dani16f","agrawald","smijat","sachinss","antonioo","emblem","srswamy","erinye","tatesgar","owenjung","leelind8","gcandrew","madison5","alexanrs","stanny04","mayamk","ekkno","ivypchen","jro26","vberm","jaynea","kkhadavi","lsosnick","enordin","lhester","gw3n","gracejxq","ellarh","ashantin","lilaanne","rranjan1","jamesp26","enrocha","campos03"]},{"id":980191051,"topic":"ugs","slug":"antoniomilane","title":"Antonio for Undergrad Senate","content":"Hello!!!\n\nMy name is Antonio Milane, and I am a freshman studying economics and computer science. I reside within the FloMo area and partake in the SLE curriculum. At the moment, I am a Neighborhood O council representative, which is a position where I design events for the neighborhood community.\n\nMy reason for running:\n\nThe world is a dark place with not much sunshine. For most of my life, I've understood what it means to live under discrimination. \"The other\" my second name because of the way I look and the function of my body. Although I am in no way different than any other person in the world, just a little bit unfamiliar.\n\nComing to Stanford has been a dream as my cohort has embraced me with an open mind, and this made all the difference. Sadly, I feel that the administration does not follow the tune of our cohort and prioritizes superficial attitudes over making a difference. Just opening The Daily can make this apparent. \n\nIn the following years, I want to ensure that the sun still shines on our beautiful campus. This means that my campaign is to make sure that all students have an equal right to opportunities and that each student treats the other with compassion. Moreover, I will fight for those who are unheard of and push against discriminatory policies. \n\nThank you so much,\n\nSincerely,\nAntonio Milane","user":"milane","signees":["a9koh","acwaterf","adehmani","aileenle","akhawaja","alee2187","alexra24","alisaga","amados","aminsajj","amurran","anafmc","aoberoi","arpm","aservice","askor","avdlc","avnivats","bmeneses","bohou","ciraulo","clairez","cordovam","cwang26","daisywyh","danigg","daubuch","dawn9","dcureton","ddesir","dmeyer26","dsallis","dukesr","eebssa","egeturan","egurwitz","eharden","ejd47","eli26","ellawang","erich04","ewest1","fbravo","ftantawy","gaustinb","gdmagana","gmart8","gmontes","grace24","grincon","grwong","hasan17","hazelj","henakhan","idavis","ideutsch","iluna","iszabo","jmba812","jruzekow","juliaf8","kaelyn01","karen330","kge","larissal","lcarlin","lh03","lianwang","lillian4","lms512","lrn25","maxjcamp","miacano","mikaelao","mirawan","mnferrer","moraa","mpeters4","msolberg","nanagara","ngumel12","nsveiven","olorch","ovq27","pabloram","pkty","ramya1","rawleyh","rlmuniz","ryank123","sayp","sebcolon","selaine","serena25","sestra68","skye1","sophiesz","sungcl","sylvainp","trianah","tuant532","vguru","vmadan","yamilett","yastika","zarahsan","zlanter","ztweedie"]},{"id":980191006,"topic":"ugs","slug":"johan4senate","title":"Johan Sotelo for UG Senate","content":"Hi all! I'm Johan Sotelo, a current sophomore majoring in Management Science and Engineering. I am running for Undergraduate Senate with the priority of boosting student life, improving funding policies and procedures to support student organizations better, and creating more opportunities for students' voices to be heard. With the hopes of running for Appropriations Chair in the Senate, I want to help undergraduate groups better understand the financial support process and increase transparency. Along with working on many priorities that impact the broad student population, such as transportation, affordability on campus, and mental health resources. I have worked in various leadership positions with student groups and campus departments that have helped me better understand the needs of students and organizations. I can't wait to implement meaningful and positive change for the Stanford student community, so I look forward to your vote in the election! ","user":"jsotelo","signees":["alanah16","asurana","baron666","bpatrick","calderie","ccahilly","chaelyna","challee","cmaximos","cmorereg","cskwara","doueiriz","dsallis","dsarraf","ekahsay","er615997","etianshi","gautham","gurmenb","hbasali","jennaali","junagle","katiek24","kdragone","kwindley","laurenhe","leilades","mansueto","mariogn","melinast","mtsosi21","norabrew","pkkim","rishirv","rshreya","ryloo","sdeberry","sestra68","sherryl","tdarryl","tishrei","udashavi","zvnguyen"]},{"id":980191029,"topic":"ugs","slug":"avatiffany","title":"Ava Tiffany for UGS","content":"Hey everyone!\n\nMy name is Ava Tiffany, and I am a first-year student here at Stanford desiring to run for the Stanford Undergraduate Senate!\nI am from Dallas, TX, and I am so grateful to now call Stanford home :).\n\nAs of now (LOL), I’m pursuing a major in International Relations with a primary specialization in International History and Culture and a secondary specialization in Social Development and Human Well-Being. I’m also looking to pursue minors in Data Science and Psychology (social psych is my fav).\nI’m fascinated by human behavior and organization, and studying the intersection between history, culture, society, human-decision making, and data collection is the perfect confluence of all my interests -- I am excited to be able to pursue these academic interests here at Stanford.\n\nMy deep passion for human well-being and success has always drawn me to organizations and communities focused on mental health and wellness reform. Although I am passionate about many issues affecting undergraduates from Student Life to Communications, Mental Health Reform and overall Student Wellbeing would be major areas of focus for me if elected to be an Undergraduate Senator.\nIn addition to advancing beneficial, long-lasting change in my passion areas, I also desire to run for the Senate to get more involved with the Stanford community and meet friends who are similarly interested in creating meaningful change and serving the Stanford community.\n\nI have extensive experience with Student Government. I served on the Student Government of my middle school and high school all throughout and was elected to serve as the Student Body President my senior year. As Student Body President, I was the primary liaison between the Student Government, the Student Body (2,500 students), and the Administration, and oversaw all of StuCo's activities.\nUnder my leadership, my high school's student council conducted various initiatives that prepared me for action as a Senator. After some devastating events in our student body and community, my council decided we wanted to heavily emphasize Mental Health and Wellness in the student body.\nLast year, we introduced \"Wellness Wednesdays\", a bi-monthly initiative that brought acclaimed speakers to the high school during all student lunches to speak on topics critical for Mental Health and Wellness Education. While piloting this program, we similarly led our annual Homecoming Dance, Inclusion Week, and 7th Race to End Racism Forum (a leadership forum where representatives from over 30+ Texas high schools come to talk about ways to increase Diversity, Equity, and Inclusion on their campuses).\n\nI always lead and contribute with my heart-first; my enthusiasm, inquisitive-nature, and hard-working personality, my deep desire to serve, and my willingness to take initiative are just a couple reasons why I believe I would make a great Senator. Other strengths of mine include written and oral communication, scheduling and time-management, and leadership and inspiration.  If you sign, I promise to bring my very best to the UGS every week!\n\nIn my free time, I enjoy sunshine :), dancing (I’ve competitively danced all throughout my life -- I'm a member of Innovative Styles on campus and will be a Stanford Dollie next year), long walks with podcasts and country music (controversial, I know), dystopian and popular psychology novels, avocado toast, traveling, and meeting new people!\n\nIf you have any questions or concerns, please feel free to reach out. I would LOVE to connect! - avatiff@stanford.edu \n\nThank you again for your support! It means so much! \u003c3\n\nGratefully,\nAva Tiffany","user":"avatiff","signees":["nadiac","ttliu00","terrones","aiyer23","ychen23","nhild","alyssa17","kreveno","bshortt","ewang24","sophchun","adenb","diegok12","wgibson","ariarias","jpetersj","dangold","jeklund","zzafran","cyli79","mackj","karinach","gregkal","earteaga","nsussman","daisy04","kaitlyn5","mikacich","blokhina","sengthay","isagxd","kcarido","josie25","avakerk","hichews","awang01","jbowsher","jmflynn","evageier","ceesa","mirna22","hbstew","ajvb","mduffy8","avalove","sheina","ews307","zteplin","shpotter","huertam","tgilli","amallott","chiaras","elisepb","cmaximos","gmart8","gmontes","eehirsch","bristueb","hummelta","dcureton","tdarryl","glallen","lkoong","jacobriv","adehmani","laithg","wbriger","newsoms","gstretch","dawn9","amf22","esutro","maghawk5","cortmac","gcks132","phoebe1","orose","guidoleo","piasecki","sek27","renachao","tsneed","rishi26","miradeb","lcioffi","mc0201","ebrew","mgarvey1","agliang","dkumsa","emilysuh","dantrejo","holdenm","ktm9632","aroserob","mweis2","rwchan5","amelie9","lizamik","nburik","lulosada","joefata","jmtejeda","nnrl","yashm","ziminq","henrys1","heloiseh","aarquin","franalva","merveo","miraravi","sofie","gcandrew","madison5","ekkno","kenlal","ivypchen","acra","sfazioli","daschl","andrewhz","lhester","eliek","sschultz","jakeleon","alexkate","shuster","pjdagsi","mljohns","vaughn01","tolani26","jchen04","sartand1","lenamik1","cbfarcan"]},{"id":980191042,"topic":"class_pres2","slug":"rise","title":"Re-Elect RISE for Junior Class President","content":"Hey Class of ‘25! \n\nWe are Shreya Ramachandran, Siddharth Sharma, Blaine Wells, Jason Lin, Veronica Aranda, and Daniel Mottesi, and we’re honored to run for re-election to be your junior class presidents! \n\nLast year, as your representatives, we promised to R. I. S. E. to the occasion by Reimagining Inclusivity and Social Engagement at Stanford. It’s time for a status report. What have we been up to?\n\nThrough this year, we’ve learned the ropes of making stuff happen at Stanford — and put together some pretty great events along the way, centering inclusivity and creating spaces of belonging on campus:\n• Sophomore Formal with live jazz, professional catering, and swanky decor!\n• x5 Mental Health Boba nights with 400+ attendees at each event!\n• Night market: 6 vendors, 6 performing groups, many smiles\n• Sophomore sunrise with free merch and food\n\n\nAnd we’re not even done for the year. Stay tuned for Sophomore Sunset and more!\n\nBut we feel like we can go further. Of course we’ll continue organizing large events. But on top of events, a new priority is to create resources and community spaces which you can use at any time. We’re hashing out direct suggestion forms, mental health resources, policy changes through working with the Senate, and more. If you have ideas on this, we’d love to hear at this link: https://tinyurl.com/RISEfeedbackform\n\nAt the end of the day, we’re proud of the red tape we’ve cut through and the events we’ve put together so far — creating excuses for us as a class to get together and meet new people. But we have so much more we hope to do. We’re excited to tackle these challenges with a new slate that mixes experience with new blood: Four returning members will bring organizing savvy, and two new members will bring new ideas and perspectives to the table. We’d be honored to serve you again and to have your vote of confidence.\n\nSincerely,\nRISE :)\n\n[RISE - Junior Class Pres Flyer 1  (1).png]","user":"rshreya","signees":["a01liang","adeloera","afelicia","akim24","akrinos","akwok25","alexlee3","alicel1","amaturo","amayam","ananyagu","aniketh","anniezhu","ari17","ariarias","asanyal","avakerk","azhan9","bkhoo","bkwells","camron","cathyzbn","changrc","chloe818","cvlim","cytang","daia12","ddl","diegobus","diegok12","dkreddy","dsallis","dzeibert","edward27","emmwang","ggg425","ginger24","gradyh","hclay116","hhhwang","hickmann","hrg","iskhare","ivanjj","jallchin","jamorice","jasoncl","jbloom0","jlim223","jmb25","joshia","josieb24","jrhee25","kevinli7","klaraat","labroche","leiivery","lholiday","lilavdb","lmoberly","lmorley","lskaling","ltw","lucyzim","lwinkley","mbfly","mimoya","mishgov","mlintott","mottesid","msoul","natfoo","nicolese","nicortes","no6279","ohmpatel","ortricio","parkerd","pbaker03","reesed","regcsev","riensche","rliu25","rshreya","sachino","sebcolon","serenakt","sgfan","skonar","sontee18","suppakit","tali01","tedhick","thamhank","tobey","tsvoboda","tylerho","varanda","vedantk","vhan","wfang03","ysingh","zzafran"]},{"id":980191021,"topic":"class_pres1","slug":"rishi","title":"Rishi, Edgar, Amelie, and Bennie for Prez","content":"Rishi Jain, Edgar Arteaga, Amelie Or, Bennie Nkwantabisa","user":"rishi26","signees":["emme","sagehs","ashleyt7","mars7418","tinali","narment2","rawleyh","earteaga","daisy04","efeleke","blokhina","sengthay","ashleynm","rmabdull","kpashin","gracekt","alanaesp","araomit","luis1031","adibsood","jmdavids","sophiesz","alvajosh","bigsean","amytngnn","aysun1","jbowsher","ajvb","aileenle","wangeles","samdizon","tgilli","elijahbw","maxjcamp","chiaras","amiri03","aew0114","dcastrom","gmontes","notjoel","katiehef","changtif","celewis","bnkwa03","anafmc","gsandman","hummelta","caeley","annase","aadisaha","bkinder","kghosh04","glallen","lizbethz","cesy04","summer04","aszhou04","wbriger","lboogie","losmith","crkang","taralyn","deangrey","annacr","wcleary","sbaldeon","annaghul","dannach","zachboh","ddesir","renachao","schnebly","db6","marcosg","rishi26","ruheenem","sohrabh","skolla","khetts","dantrejo","amanis","enm26","amelie9","lizamik","anishch","khealzer","lauren04","jmtejeda","porsche","yashm","jrroach","chris11","agrawald","erich04","smijat","antonioo","annatav","henrys1","chhadia","lindatrn","heloiseh","pochoa1","erinye","tatesgar","berkyalc","aouyang1","sofie","leelind8","filiph","ndemilew","crezende","vberm","hicksh","jjosh","clkramer","keirac","solims","avnivats","joshwal","gmw","mdrand","amina1","vromano","gw3n","zasemota","giseller","maddoxd","chawwari","ashantin","hantczak","jakeleon","emiyare","alexkate","akonig45","ryansb","thardy74","nmenon26","jjhb","olinw","egeturan","omdpatel","morgan22","lbollyky","pm1220","kasha","emorenoa","gwk","nickcamp","jasleen","lenamik1"]},{"id":980191022,"topic":"class_pres3","slug":"the_treehouse","title":"Re-Elect the Treehouse for Senior Class Presidents!","content":"Dear Class of 2024, \nWe are The Treehouse - Jack Scala, Easha Nandyala, Hannah Basali, and Michael Chhay - your current Junior Class Presidents and future Senior Class Presidents! We created this slate with diversity, in every sense, in mind. We have a variety of experiences, ranging from working at the Cardinal Haas Center for Public Service and the Stanford Daily to organizing and performing at concerts. We represent a range of majors: Biology, English, Political Science, and Aerospace Engineering, exemplifying the diverse interests of our class. \n Despite our differences, we all are on the same page about one thing: a campus is a set of buildings, but the people are what makes Stanford special. We want to continue to serve you as your Class Presidents to help connect our class through engaging events that you won’t want to miss. \nAs Junior Class Presidents, we have had the honor of serving our class for the last two years and creating a home for the Class of 2024 at Stanford. We have worked tirelessly to ensure that there’s an event for everyone - some of our favorites include a Sophomore Formal, Major Meetups, Junior WinterFest, Club Cupid at the Guild, and our Superbowl Parties for football and pizza fans alike, as well as our upcoming Junior Gala. Since we started at the beginning of our sophomore year, we experienced record turnout and engagement from all of you, which helped us create an unparalleled sense of community. Looking forward, we want to strengthen these bonds we created this year through our Senior year as your Class Presidents once again.\nThe Treehouse is excited to bring these ideas into fruition and work with the Class of 2024 to create the ultimate Senior year experience. We cannot thank you enough for showing up to all of our events with enthusiasm and support, and we hope to serve you in our final year as Senior Class presidents. We have the experience and passion to make sure our last year at Stanford is our best yet! \n\nSincerely,\nThe Treehouse","user":"jscala20","signees":["adehmani","adenb","ads12","ajia","akps","amromo","anoushka","arahman1","ashiravi","ayannam","aydhall","badillo","bbower","beleigh","benefarr","bradleyh","bzaidel","callcott","camadams","cate02","ccahilly","cgebby","chen2020","cmvan","cp0249","devenp14","easha","edoyin","egmill","elnorman","erouffy","esrincon","etchak","etiao02","faierman","faithz","fin","gcbel","gdmagana","george02","gseir","gurmenb","hannahoo","hbasali","hsilva","ijordan","isagxd","ishaanks","isobelt","iyeu","jaraujo","jchauhan","jjk52","jlee2024","joseph72","joyyun","jscala20","jzients","kconte","kcverner","klambert","kmpeng","kools","kreveno","kszheng","kylafig5","lafuta","laswopes","leilades","lktaylor","mahira1","malachif","mayoob","mchhay","megjin","melgong","melinast","mend0za","miacano","mkounga","mszhu","neelsn","nlyles","nolaye94","nsala","ntan23","oliviayl","pengalex","pillutla","pjkim","pritir","quennie","radhikas","rheakale","rosa2024","sestra68","siwooahn","sronaghi","svahan","svaughn4","sxiao1","tishrei","tommyesc","vxin","wypark","xlorenzo","ydalmia","zlxi"]},{"id":980191016,"topic":"exec","slug":"christiangurmen4exec","title":"Christian Sanchez and Gurmenjit Bahia for Executive ","content":"Hi all! \n\nWe are Christian Sanchez (He/Him) and Gurmenjit Bahia (She/Her), and we want to continue serving you! We are excited to announce that we are running for Executive President and Vice President! \n\nAs members of the FLI, transfer (Christian), South Asian, and Latine communities, we are passionate students who advocate for the holistic well-being of all students in the Stanford Community: undergraduates, graduate students, coterminal students, transfer and international students, as well as other community members: custodial staff, campus residents, and all who play an important role in life at Stanford. \n\nWe are committed to fighting for you! As current Executive Vice-President and Undergraduate Senator serving as Faculty Senate Representative, we have worked tirelessly this past year to improve upon different aspects of campus and student life including the continued advocacy of graduate student needs and affordability, advancement of free textbooks, the reinstatement of the shopping express line and the return of the N\u0026O Marguerite lines, and addressing sexual assault responses and faculty-specific offenses. \n\nWe hope to continue creating a sustainable Stanford that spotlights various communities to help enrich campus culture, social life, and resources while improving student life and wellness through holding administration accountable and scaling the partnerships established all based on 4 major principles: Wellness, Community Empowerment, Affordability, and Student Safety (WCAS -\u003e We Care About Students 😆) to fight for a better Stanford: \n\n• Wellness: Student wellness has continually been under attack. We demand resources and systems in place to ensure students' physical, mental, social, and environmental wellness. \n• Community Empowerment: We feel that the communities that we turn to as students are crucial in our development as global citizens and should be supported by our organization (ASSU) for continued sustainability.\n• Affordability: Life at Stanford is a privilege that we have been afforded, but it is also an expensive life. Advocating for both undergraduate and graduate students to have the proper financial support and their basic needs met is central to their functioning and success. \n• Student Safety: Students should feel safe on a daily basis on campus as they engage in their passions and exercise their intellectual vitality. We seek to ensure that all students feel comfortable, supported, and safe on campus. \n\n\nTo learn more about our track record and our plans visit our platform here! Please support us by signing our petition and following us on Instagram @christian.gurmenjit.4exec to stay updated on our platform! \n\nPlease do not hesitate to contact us to provide feedback and learn more about our campaign platform (cfsan86@stanford.edu and gurmenb@stanford.edu) or by filling out this form. We would love to hear from you! Much love!","user":"gurmenb","signees":["joshia","sarahjd","oabiose","yildiz","csblack","amukund","cdundes","tschw190","jzients","janiad","mhorst","mhunter8","knatalia","sonia17","jay632","jdweiss","glikbarg","surag","propp","kn6nes","eschell","lbrown27","cfblythe","krapivin","yalan","kmentzer","simrin","toledano","pennyshi","shuskins","jajohn","lkeesing","mgrewal","alinaw","kagould","jasminp","liuto","alan2010","cparisua","jeflores","lasambel","mjaarte","sanketg","ben512k","akmaske","canmai","blenk","ebenitez","eaavila","bho24","akasha","hasant","abhi1","wongtina","xlorenzo","asalc14","tymina","jisaburo","jd6390","lluqueno","kjax","erpark","kyap","pawmarg","mayoob","balbin3","jflores1","nedonkor","ehsu57","mjacquez","mbonanni","mariogn","jmukobi","vic1329","grincon","phillicl","kuhegbu","nolaye94","mebund","lachnitt","laisha","caylaw","karlarom","kzepeda","mbeeman","jpdsilva","lblackst","jankelow","schoi02","shrestp","zvnguyen","imercado","tomquach","braja24","klambert","cmvan","shreyava","ejd47","jk23541","ishaanks","jordanam","jenkin02","bl031520","swambu","justiceo","vle17","alexboni","vhelm","wildwest","p6450309","m314089","dthao","weihchen","zanechan","gossd813","popowski","zgran","cmflow","mollyeg","oliverx","eapple25","msoul","drak","sorosco","rshreya","emgchan","abelmart","annag25","carowei","spenseay","sdsam","kaitcs","dsallis","ivanjj","calcntar","asanyal","sdortega","e7772000","kguti92","maluna","zouberou","sppc0004","sarahrm","asingh11","cfsan86","xime","eapraku","nhtran","diegogtz","ovq27","djcald04","jchav21","gerardoa","sestra68","vpollak","isagxd","trhall","angela20","jsotelo","gianny","rmabdull","raigosa","skavya","jiajuliu","vivigles","rgrekin","linniej","jand271","josie25","vchiprez","pritir","hokj27","briana22","miacano","tracyha","nsala","badilloc","amytngnn","wynnkhe","selaine","cehsan","hasan17","jsiskind","gabefm","acuevas","zhuojing","esoroka","juliavu","shaedol","mpeters4","jamesu72","ygarcia4","thedges","mcshea","akhawaja","rcastane","aqib","patwei","aluffman","caiofg","allysaw","jungyoj","cmaximos","ericamcc","abellej","ptnobel","arec","kramerrr","calderie","rcarino","mridge22","abms","okonkwo","koyewole","xtchang","tdarryl","glallen","rtati","zcs2024","taniaf","cesy04","tgfisher","cheungs","trepka","rhage","ljberg","meganwoo","ssruthi","crkang","purisima","ke22019","ddesir","ngumel12","njain26","emichan","ranab","jhorenzi","kellysb","ramya1","mc8ew","mtacke","marchini","vjansari","sufiyanj","alicezhu","tamish01","egupta","jjhb","knlam","jcamara","ztrexler","jchen04","cobbmack","dbruce","copans","fischer9","akashc","gbasel","ards2004","zgab18","benitez7","bried","jsusant","janehrdz","brenrene"]},{"id":980191017,"topic":"ugs","slug":"carmenkangstudentsenate","title":"Carmen Kang for ASSU!","content":"Dear Trees, \n\nHello! I am Carmen Kang (she/her), a freshman hoping to resolve urgent concerns of our student body while cooperating with the other creative minds of ASSU. With my experience in student/youth advocacy, including founding and leading the Korean Youth Council, organizing flea markets that raised funds for multicultural students and their families, and curating group exhibitions for underrepresented artists, I will be a senator who endeavors to bring increased fun, safety, convenience, justice, and equal representation to the Stanford campus. \n\nOn campus, I am currently involved in Neighborhood T Council and Stanford ASSU Senate Associate Program, focusing on improving student life and campus safety at Stanford. Moreover, I look forward to seeking the best ways to liaise with the student body as part of SIG.  \n\nIf you're looking for a trustworthy, compassionate, and devoted leader, vote for Carmen! \n\nAny questions or curious about what I can do for our community? \nReach out through Instagram (@crmnkang) or email (crkang@stanford.edu).\n\nWarm regards,\n\nCarmen Kang","user":"crkang","signees":["acshi","adehmani","aileener","aileenle","aindla","albertc4","alexhliu","alicezhu","alinadav","aliyan","amdedios","andrewzc","annabc","annase","anushad","asmith26","atirao","bdeirdre","bdono","bennypan","bhud1224","chenl8","cmaximos","crkang","danigg","dariagus","dinarazi","dmoore24","dp0107","dragon13","drewsung","dsallis","ehadar37","elianac2","emily22","evhur","glallen","govande","grahamjo","gurmenb","hamra","hannah04","hpark23","hsow","hyunjun","ilaria04","isabdr","iskalia","ivypchen","jasgosal","jasshin","jdarve","jluzhang","josfran","jrin","jsduan","jules109","kilasg","knatalia","kyoung13","leelind8","leesusan","lisacliu","lulusul","lyleg","maxhyaj","maxjcamp","mbuyan","minaky","mliu1785","natbai2","nejo","nharvey","ninjinb","ntlim77","outerhv","paolagd","peyton04","rchiek","sahilc","samchen2","samgupta","sbarnes1","scrowley","sestra68","sghosh26","sherryl","shrishj","sivale28","sjoshi4","sjoybang","slee93","smixon","sophiesz","sukara","taryntho","tdarryl","theovp","titus000","tommydb","wangeles","wherz","zephron7"]},{"id":980191036,"topic":"ugs","slug":"evan4senate","title":"Evan4Senate","content":"Hey everyone, my name is Evan, and I am running for the ASSU Senate. Here are a few of my ideas, so that you can get a feel for my platform. \n\n1. Recently, a spree of anti-semitic imagery drawn in public spaces on our campus has cast a shadow over my experience at Stanford, as well as the experiences of many other Jewish students that I have spoken to. I will work to encourage and facilitate activism to organize against the hatred that is growing bolder both on campus and in the country in general. As a member of the senate, I would work to build a coalition between marginalized groups, building understanding, and thus power against hate and ignorance.\n2. I will emphasize the value of the arts for student mental health, seeking to ensure stress-free and immediate access to artistic expression. For me, playing music with friends in my free time has allowed me to process school work much quicker, so I’ll passionately advocate for this.\n3. I will advocate for the creation of more outside night-time destinations on campus. We have so many people here, yet much of campus remains dark and desolate at night. I’d like to see more inviting lighting and activities being put up in these areas.\n\n\nThat’s about it for now. If you have any questions or want to introduce topics that are important to you, please reach out!\n\nThanks,\nEvan","user":"eaubry","signees":["aaryans","agy","alee2187","alexra24","aluffman","anafmc","aoberoi","arosalia","aservice","avnivats","bennypan","bohou","chenault","chiaras","clairez","cordovam","cwang26","dandaek","dani16f","danign","elijahm","elitoney","erich04","ewest1","gdmagana","hazelj","htjkatz","ideutsch","izzyip","jlim223","jruzekow","karen330","kasha","katcosta","leemary","lillian4","lms512","lrn25","lulusul","maimunam","mars7418","maxjcamp","miclop16","moraa","mweis2","nageenas","nanagara","nicozez","nznicho1","ogunremi","owenjung","pabaill","peehu","rathi","rlmuniz","sherryl","sophiagd","tabibian","tdarryl","wheafey","yamilett","yanakim","ziyuef","zlanter"]},{"id":980191031,"topic":"ugs","slug":"ishaanforsenate","title":"elect ishaan!","content":"after year 1 in the senate I've helped get RAs guaranteed access to narcan, worked with Perfusion to improve training modules, worked with ResEd to redistribute RAs to the row, and advocated for higher pay for RAs and significant modifications to the neighborhood system.  Please sign to give me the chance to run again!","user":"ishaanks","signees":["andrew49","atidd","zivabk","jodalysh","joshkang","rpigott","samuelao","waymon","nzamoraz","sasloan","abhi1","aen2001","isaac007","cp0249","chon","chen2020","ksesben","geathers","keselius","nitarac","ajoshi45","ehui","mhutch24","gaustinb","meganjl","ilanlad","alexkwon","chikin","hliu24","kristiep","nhiywin","iyhn8192","spribus","grincon","anoushka","nsalunke","brsharma","laswopes","csze","haleyst","avilla16","suno","svisokay","kuhegbu","nolaye94","achan51","regcsev","jsxiong","lcarlin","gavinmcd","juliazhu","rogerxia","akps","samthapa","jscala20","adenb","vxin","ejd47","gurmenb","gilsaenz","lktaylor","megjin","jk23541","benzuzi","nhagos","ishaanks","codyho","aao2002","nickliem","radhikas","jweiler","abhydev5","rbraz","ixxia","serenska","nhass","allisj","lukeveit","badlani","bradmoon","l0ng","holdentn","scottvu","mathenyr","cnair","sshah21","nchi1","syyan","adesai10","tgolob","etianshi","dansun","hdunn5","vijaynj","cfsan86","osibal","juliabh","carriec6","ntan23","mlintott","ksmadrid","aliceku","nsala","gvadmal","hasan17","tshim24","nickthac","ghussein","amaru","mpeters4","mina1317","huertam","jgfoltz","rmwoody","jdollard","erouffy","tdarryl","rtati","a314159","landonw","sscherf","adehmani","poojanp","jmtejeda","elanna","guylevin","petewest","bbyan"]},{"id":980191023,"topic":"ag_petition","slug":"fundsmt","title":"Help Fund Stanford Mock Trial!","content":"If you’re reading this, thank you! Stanford Mock Trial would really love your help. \n\n Stanford Mock Trial is a student-run club that competes in the American Mock Trial Association's national competition, provides legal training to students -- no matter their previous experience, background, or identity -- and seeks to advance social justice in the legal field. As a program, Stanford Mock Trial is incredibly diverse in terms of majors, financial background, sexual identities, race, gender, and previous mock trial experience. In fact, 75% of our new members this year had no mock trial background upon trying out! Beyond this, Stanford Mock Trial has also been at the forefront of advancing social justice among mock trial teams, including the popular “Mock Trial Pledge” started by former President, Elizabeth Grant, to combat sexism within the legal field. The pledge has been viewed tens of thousands of times and has inspired conversations within undergraduate mock trial teams across the nation. We’d like to continue this mission next year as well; but to do so, we need your help.\n\nUnfortunately, this annual grant cycle, ASSU didn't review our annual grant. Despite being titled and dated for this upcoming year, due to a technical error, our grant was misclassified for the prior year; and as a result, it was not assigned for review. This budget was drafted after numerous conversations with ASSU senators -- who we thank for their help and guidance -- and is, as far as we are aware, fully compliant with the policies of this year. To our knowledge, the only issue is the misclassification of the year. We were made aware of this situation by ASSU, and undergraduate senators on the Appropriations Committee have encouraged us to petition for the annual grant we submitted – so that’s what we’re doing here.\n\nOur annual grant represents over 80% of our funding; and simply put, without it, we will not be able to take on new members, nor will we be able to offer the same opportunities this next year. Stanford Mock Trial is committed to making the legal field as equitable and accessible as possible - a mission that requires this level of funding. That's why we’re filing this petition.\n\nWe really need your help. With this annual grant petition, we will continue to represent Stanford as a top-ten national team, train the next generation of litigators, and fight for a better legal system. We hope you join us in our mission!\n\nIf you have any questions or would like to help us out, please reach out to our Financial Officer and Petition Sponsor, Austin Bennett (gaustinb@stanford.edu) at (781)-801-0170 with any questions. Please note that while the 23-24 grant lists the academic year as 2022-2023, we are applying for these funds for the 2023-2024 academic year! \n\nReference Documents:\nSMT's 22-23 Expenses:[SMT_Expenses_FY_22-23.pdf]\nSMT's 22-23 Approved Annual Grant: [SMT_Annual_Grant_Application_FY_22_23.pdf]\nSMT's 23-24 Requested Annual Grant:[SMT_Annual_Grant_Application_FY_23_24.pdf]\n\n[SMT_Irvine_Photo.jpg]","user":"gaustinb","signees":["ykadadi","jjoner","dbournat","mihirana","sanchezt","asarvesh","dfung4","tali01","lforman2","ykotb","george25","kesbaker","joshia","winsonc","csblack","tiaram27","skonar","zhang772","victor5","zachlin","tinally","callia","mtillery","egurwitz","bhord","adevito","hosono","levani","eschell","ampudia","kjavi","darrowh","ego627","bwjiang","nharvey","parksm","natalie1","sirdavid","schaider","hanwu71","kroegerj","cdenicol","rodneyg1","hyattmeg","shuskins","lkeesing","lvblack","riloos","shenhen","jmfinley","kosuna","emer","sarahyri","isat","finns23","es101701","rileysh","kogen","vpratt23","joelx","meking29","spete","bkorngie","rnegate","ehdickey","avhuynh","moserj","darylab","ellawang","cchoi1","chokia","kkotchum","davidw23","aimeyer","mfkhalil","lsmith23","wwang28","rmoktad","cazeng","brand23","esaracay","mkolod","htjkatz","lslawson","gandara","waymon","sstev8","isaac515","schen01","louisez","rdesai2","sophiego","fsperka","trinal","shayanav","bvought","huadwi","wcr2023","gemaq","mfrangos","hiran","btf","zlarson","hhao","parthav","nsveiven","vyta23","coco24","sylcolt","fclunan","mugeman","itchytoo","alicohen","linhdan","emilyguo","ncarla67","kennanj","xavier24","kspn","smeunier","jvz0711","vythai","mquig","mporras","jlofwall","j21ls","saniss","jmcanez","yadirac","brpham","deandre","isaac007","ngocng","epalafox","cp0249","natmrrtt","buenarte","hesterc","ameliajb","bbower","daniamlo","ksesben","cath24","reesed","isaeich","zincoop","jkfberg","icarinaf","audreypd","gcrt0701","jaxfloyd","laneyc","alexh555","kenanhas","rljoseph","whofgard","n1ike","afnaan","gaustinb","flurie","gdmagana","djmaceda","ljloughr","leeallie","renakrav","aleibly","ymabene","kmessai","hliu24","bela98","hdzdalia","rokeefe","mohitn","sophiahc","iyhn8192","cullenoc","marcopm","nilsoon3","yqazi27","riya02","zoeq","riemersd","grincon","sahir","dkreddy","jaspersk","ashiravi","avanti01","jteterin","ivantoh","mptayag","ekintiu","emmagsun","makennat","cooper2","teddy24","jvedelli","epert","jwei31","twayne1","danguo","nolaye94","nsariowa","smcc2025","sophois1","jorszag","changrc","elkinm27","beccaha","jayda","yuliana2","karlarom","gyang11","regcsev","nlyles","janay17","sassoc24","sree02","cmluong","steph02","zvnguyen","lcarlin","ercorona","riensche","sajidof","rsamadi","amatsumo","tdschout","khuang26","budnitz","tejas01","emruwinn","ataft","adenb","anniema6","klambert","agstrong","ecriss","kpodosin","pchx","cmvan","jk0530","estalcup","ejd47","jdunlop1","pangrace","yoon0215","asiar","gurmenb","lbarnet2","defneg","mkconn","noelleja","aaron626","eastan","rdlg","hankatie","emilio18","zacsmi02","janenek","dulmrt17","anggar24","arshiam","dzam","malinac","aiyanaau","cpedraza","pontee","vhsieh02","ceylan","jk23541","lmckhann","badillo","bryan101","ishaanks","oliver88","arpm","hailey24","skevane","nikita24","faizan","sgfan","rmgarg","lraaka","allyc","defjan","candron","icoloma2","pflores1","kcarolyn","priyak9","djorge43","brechchd","lizsong","skhine","aparrott","andyyt2","ixxia","abbyrose","lsq245","mbrock03","jgershon","tylerho","nhass","slyles","cgeorg","nkemobi","samjett","kdao","nowilo","jsarenay","cpham03","rachpark","ckrouch","evagoren","cburtner","anniezhu","kathwoo","avktran","sniehaus","angelath","afuloria","laurenhe","samgb","calebliu","amb42","ari17","ztweedie","ericz27","ntinker","jallchin","ccarrete","eklemp","arengo03","mollyeg","alee2187","sureen","spenglas","n3071651","nina0910","febielin","rsanda","rohanc12","moreno25","levinh","sagems","psears","giannkap","biancad1","dborg22","echoi1","kristyc","lrn25","bradmoon","dylanrd","cdalva","aadchen","eapple25","tcoghlan","itchen","jesusb25","faithf","kflowers","nicortes","mbendok","calebhj","khaslett","hgris","mhawk","amarcum","crissyl","jphsu","novialiu","lholiday","hgetahun","ngom2803","egao2","mtsosi21","lusansal","priddlet","sofiv192","gusr","manavs","mmurra","mswisher","rishirv","hanolte","wsayler","thaiv47","asolg","uneuner","penfold","kayshen","lskaling","psarthi","sjsundar","ycxie","jflodin","ayjkim","hhekmat","magbai25","manan03","connero","dangold","jnbaker","erinsu","graceaji","n26408","rehaan","cnair","tonybui7","rshreya","lucyzim","soonie15","sungcl","rxiong23","kaymyers","silvam31","rminocha","jennaali","ajung16","rnpadnis","aanya","panitar","echow24","aatluri","ebtroast","vpv23","abeljohn","sjc143","zoeyhill","jana2003","samiyazr","kmher","ajguo","shsu8","jeklund","annakies","anushkad","liannek","msolberg","serenalt","udvattam","opartam","mcolborn","shubhra","zlanter","wcrowell","tianalk","ananyagu","samighim","chenjoey","yimt","swka01","onyie","lh03","torihoge","kevin25m","oledbury","aezhang","vikram29","aqiln23","royaa","noellev","glizama7","brianx","meganl","audreynh","robz","fraphael","hlixiong","ingino","herron","kevinli7","jrbahk","hickmann","changamy","nahian","sabahmed","vguru","johnflx","kc2025","paige763","joycech","jazgonz","aduran46","jrizo","jtian25","inava001","azshan","elizhu","aaronjin","jabarca","nmaltz","leexiong","laiab","noahhtan","anushre","amadary","bperk25","oripova","tgolob","pronisvh","mismail1","pnsahoo","adsun","seveorey","dsallis","ivanjj","umuteren","tuli","jm2025","rosentha","mgsun","pjasmine","aniketh","cjburk","caitlynn","gnmoore","tsvoboda","weissr","cfsan86","juliaf8","xrussell","cyli79","sylc","jocelyn8","tegirard","henry26","cthomps","jmilani","jasoncl","stosoni","gregkal","ssu1","kdimock","vpaez","dayal","karen330","sophiemg","fonsecaj","manegan","alvega16","balba","habeeb","djcald04","jchav21","joshdelg","cordovam","aperez21","wang1080","jessipr","earteaga","katiesav","delianne","sestra68","leethbon","lenaxvii","kbaik","hassan10","choesang","vpollak","ssylvain","ayanag","parthiv","ananyaud","sachino","ogeoghan","wmcclain","juliabh","mygoldin","asmith26","ntan23","makayla4","celinach","rcatullo","sengthay","fpinciro","mnditt","wali","jatzia","amendoz1","isagxd","sylviecw","av200306","vnshenoy","ehuang25","obigler","kfeinst","malayeri","acarrnza","delrio","ashleynm","terachet","ahawk","kyu2024","alanna8","rmabdull","kpashin","rjpizzit","hunter04","gracekt","kszheng","rzwet","jnfong","sackey","diegobus","csittler","nagarcia","maryamt","ryanj9","negrone","mlintott","dtsan45","vren","jkoj25","ccheng26","vincentx","lquinta","alamy","mfenyo","gpolite","katsm","cnicks13","mandirod","aoden","rparker1","dash1603","yjenkim","piperf","nomin","jrlp","stardoby","ebwell00","elijah1","ehuangc","jbernado","miclop16","sorianod","mah2001","anab13","javokhir","gcbel","allise","jmdavids","svaughn4","emirueda","ginelle","paolagd","pritir","langaney","lyzetmh","sophiesz","abeldag","alvajosh","vedakan","izabella","amescher","pmnoerto","cathyhou","jreed24","sebcolon","iroman13","izzym","badilloc","kvwong","alicezyc","avakerk","kwahal","michpark","hayab","arjun25","amatta25","hkenneth","sherryl","ntlim77","jliu74","ltw","tmars","lbuddenh","werd","cehsan","bayfc","varanda","hanyic16","bolshen","hasan17","hrg","gabefm","acuevas","amritam4","pvazquez","ftantawy","mgoodson","zhuojing","esoroka","camadon","mquiros","cocos","mohstrom","svalente","krlai","shaedol","nicolese","avalove","lesley03","jmba812","mimoya","daphyu20","wangeles","alisaga","jamesu72","elee23","lwinkley","devyanig","smixon","ideutsch","iskhare","aqib","samarium","emiliofr","melodyc9","aluffman","mottesid","majohns3","jhundal","huertam","andreeaj","imcc2026","meganmou","skynoh","bamaro","anahi612","nathanjp","avaace3","elijahbw","jgfoltz","jvarah","chloerom","ptvera","merrilla","amallott","luciaemb","dinarazi","elisepb","arushig","chenault","bebelv","aclorgen","gmontes","lumi","truccam","lsalaz","andrewzc","ccarv","cdlr","naima","pperez14","katiehef","lillian4","jasminev","vbtien","senkaih","ethanhsu","erouffy","kasn","rjsouth","celewis","bnkwa03","arzola26","mohnec1","bristueb","jsduan","caeley","steeleb","lucianab","ehadar37","guisouza","annase","liamfay","jhthai","jkong2","mm28","kramerrr","torred","alainp23","calderie","doueiriz","elizafs","bkinder","inehring","juansd","chavicoy","abms","agmsharp","abdelory","mirawan","aili","okonkwo","kkar","koyewole","kghosh04","haileyh","shreya77","daisywyh","tdarryl","glallen","bella06","rfinley","aavaf","elijahk","rtati","cklavon","kosi","alinadav","meilanes","weavercb","sscherf","tedhick","jacobriv","egreyson","mamoah","summer04","adehmani","sfitz12","nageenas","willow","dylanv26","devn","aribarb","byeung","cnangle","reeves1","sutyazz","ianmpart","brionqye","mkounga","dwoong26","efarah","ashah24","lilla","pjae","iszabo","bless","zoecm","manat","ewest1","aminor23","cwang26","zope","gflynn22","taylormf","lhasunci","hongmeng","oliviadd","dawn9","cjshin","yaraeli","niam","sebvas","zijianl","gedelin5","tamiro","fishera1","o6640851","zararuth","taralyn","deangrey","leah26","bgealer","chhavi","lduthie","emoore26","gabes","dhoop","massiel","mohar","sbaldeon","laecic","mmelaku","nsdb","sek27","jheyer0","dannach","malekabu","agcruz","ddesir","kennycep","renachao","jle7","fletch42","schnebly","alonzia1","almhatre","abloom49","lyleg","jluzhang","gabreu","marcosg","taman21","rishi26","jdarve","albertc4","willyc","matrisk","yahli","ekatz0","tanryan","dkumsa","cgu26","pabari","rathi","dantrejo","maya31","ansarin","newsom","lisacliu","shiningx","ktm9632","dandaek","kyles7","tommydb","wskim81","whittj","lucyrose","sidnr0se","evyshen","wmusyoki","catbui","aroserob","ctraina","katyshin","mweis2","yanakim","ngualexa","sfaux","asazi","bibiana","adarsh1","rnarain7","khealzer","syu03","avabrown","lauren04","wzhu17","alexhliu","dchan04","naikdhr","jtikare","eriche26","louisely","danigg","zstjohn","lulosada","alexsoto","lulusul","rickyro","sherylh","etardif","pmiao","joefata","yuvrajb","iacohen","isaackan","nnrl","jacobr1","nneka","karolync","aclaire","tiya","aj14","oroti","samani","abhiv","chris11","agrawald","erich04","eabarca","hujason","salamotb","sachinss","prakashk","ayamine","ellathtz","emblem","tuffourv","ebeharry","heloiseh","omfarkas","joselyna","kellysb","erinye","tatesgar","lauren28","charmang","tracywei","tellez04","soph26m","aarquin","agfoess","nreinoza","sakshiu","rohan3","estellaz","ctitzer","jhuang23","jlopez04","aouyang1","anushkav","jasagye","zarathom","zbrick","scsuh","hcdemars","rohanpar","cbeamer","nzahedi","gcandrew","nestorpf","mikor","ion2004","alexanrs","sherunip","stanny04","sidpotti","sameeh","mayamk","ekkno","eganocy","leegarg","bganocy","adzhang","alexgu","ruohua22","lucanovo","chrstnk","wberr","kenlal","ivypchen","peehu","arorak","amsal","vedantch","jro26","govande","ndo2022","omarah","skpritch","annelic","hicksh","jaynea","kkhadavi","akuik","willyli","ivange","nabboud","jtosado8","inachun","jennywei","sylvainp","tabibian","ellabp","avnivats","ishanim","alexra24","aaltarej","sarasuch","phwong","gmw","bowen07","spzhang","elianac2","mdrand","lsosnick","irogando","jdgrayso","irenelin","jenayue","lhester","grwong","atkehm","maxrod","serac","ajadhav","saitot","samc10","zlakkis","destinyj","jgal","thuang26","ayushag","aidalaav","akios","walison","dkavi","ghernan2","gracejxq","ellarh","maddoxd","bdeirdre","hsosa","smion","msumali","eltonm","emmahong","cceleste","jbroma","emiyare","hannah04","alexkate","julesvel","dwiley26","sophreb","acolli","alixf","aaryans","emilinm","nguyenbk","laurenyu","rlmuniz","rcarolan","avajeffs","sbarnes1","jjyim","nmenon26","ashal","sunstone","adityau","acnoyola","skomar","tolani26","aarzooag","siyagoel","lamya26","jjxue1","emily712","charxyx","olinw","jiggy56","aaminamk","omdpatel","aliyan","arthi26","morgan22","peytonwr","rranjan1","pm1220","ndye26","jamesp26","marsoner","ishritap","llouis9","sadira","marielas","calvinb4","jaxdiego","boomer22","kimmy646","jcoronad","ericbear","akary","gracecg","emorenoa","nejo","emokine","jchoi23","avadecon","nickcamp","wgolub","joshua04","kilasg","jjk52","aerogers","sareyes","mstojkov","trianah","habraham","sofiagon","yja25","evansing","jlxuted","dblawlar","tedsong","campos03","ktorg","jsusant"]},{"id":980191024,"topic":"gsc","slug":"andrewgsc","title":"Andrew GSC","content":"I am running for the Graduate Student Council because I want to build more bridges across Stanford's amazing graduate schools. I feel like we are too siloed right now and we just need more events bringing together graduate students across the university for the school-wide community to grow stronger.","user":"parka","signees":[]},{"id":980191025,"topic":"gsc","slug":"abieiden","title":"Abi for GSC","content":"Hi my name is Abi Lopez, I’d like to run to be in the graduate student council. Please see my website to learn more about me: https://abieiden.github.io/mywebsite/ . You can also find me on LinkedIn:  https://www.linkedin.com/in/abieiden/ . My email is: abieiden@stanford.edu . My number is (310)667-2580. ","user":"abieiden","signees":["abieiden","eschell"]},{"id":980191026,"topic":"ugs","slug":"ivy4senate","title":"Ivy Chen for ASSU Senate","content":"Hi everyone! My name is Ivy Chen (she/her) and I am running to be your Undergraduate Senator! As a child of immigrants and a first-generation student, I am deeply committed and passionate about incorporating student voices to improve Stanford both academically and socially. From serving on Frosh Council to growing my student government experience on ASSU SAP to being involved in numerous political advocacy clubs on campus, I am ready to serve YOU and listen to YOUR voice. \n\nI won’t lie, and I’m sure many of you can relate: when coming to Stanford, I had high expectations and unfortunately, I’ve been let down. Our campus isn’t safe at night, with dark lighting and safety alerts constantly pinging our phones. Our campus doesn’t provide accessible transportation options, with no weekend or night buses, no bus line to accessible affordable shopping areas (it’s time to bring back the Marguerite N \u0026 O lines), and 5-SURE’s crazy wait times (it’s time to bring more funding to increase pay for drivers and to add in more cars). Our campus doesn’t support student wellbeing, with a lack of resources to address mental health, a lack of response to sexual violence, and minimal resources to support FLI students. This needs to CHANGE. Our campus can do a lot better and that is why I am running to make Stanford a better place.\n\nPrior to coming to Stanford, I was heavily involved in advocacy and activism. I was on the Superintendent Advisory Council, where I represented over 2000 students to implement county-wide resolutions into my high school and oversaw the decision making process for 190k+ students in Fairfax County Public Schools (a school division in Virginia) on matters related to mental health, technology education, and environmental sustainability. Additionally, I was a Youth Governing Board Member for the McLean Community Center (a local government branch in Virginia) in which I represented over 110,100 constituents and 39,000 households living in the district, working to bring events under an $18 million budget. With educational equity having a special place in my heart, I’ve fought to make education more accessible and affordable for students in my community through volunteer work and interning for political campaigns to make educational access a priority in politics. I have also written legislation and lobbied bills in Congress pertaining to facial recognition and gun violence. I’m excited to bring my previous experiences of fighting for change to the ASSU Senate. \n\nNo more barriers and no more excuses, let’s get work done because it’s about damn time. I’m done waiting and if you are too, vote Ivy Chen for ASSU Undergraduate Senate. \n\n✅ Want to voice your concerns and opinions? You can email me at ivypchen@stanford.edu or message me on instagram @ivy4senate so I can listen to you and hear from you.\n✅ Follow @ivy4senate on instagram to stay updated with my campaign and my platform. \n\nVote Ivy for Senate! 🗳️\n\n[Vote Ivy Chen for ASSU Senate]","user":"ivypchen","signees":["acarrnza","acolli","adehmani","aili","alexra24","anafmc","andrew49","aoberoi","aouyang1","araomit","arianarr","auday","avnivats","bmeneses","bohou","ccheng26","celinach","cesy04","changtif","chrstnk","ciraulo","colinmck","crkang","dandaek","dani16f","diegok12","dmaemoto","dmeyer26","drewsung","dylanv26","eabarca","elee23","elijahm","emiliofr","emilysuh","erich04","erinye","etardif","ewest1","gaustinb","gdmagana","glallen","gmontes","gsandman","guck","gurmenb","gwk","hawe","hazelj","inachun","ishritap","ivypchen","jasgosal","jaylonj","jjyim","jlim223","jmdavids","jmtejeda","joewar","kasn","kpashin","kramerrr","leemary","liujudy","lmckhann","lms512","mallencu","mars7418","maxjcamp","mg090104","milane","mirawan","moraa","mweis2","mwidodo","mzhu33","nanagara","ngualexa","nznicho1","ofsabir","owenjung","paolagd","peehu","rawleyh","rranjan1","rtati","ryanmtle","sebvas","sengthay","sestra68","sherryl","smahate","solims","taryntho","tdarryl","tjp2608","tracywei","vberm","vpollak","yanakim","zhane04"]},{"id":980191028,"topic":"ugs","slug":"upadhyar","title":"RICHA UPADHYAY for SENATE!","content":"Hey everyone! My name is Richa Upadhyay (she/her) and I'm running for undergraduate senate. I'm a current junior from sunny San Diego. On campus, you'll likely catch me studying at the GSB, munching at yaga, or practicing biking with no hands. I'm a committed Roblover and involved with Cardinal Policy Group and the Stanford Political Union. I'm committed to increasing transparency between admin and students and keeping campus a fun and safe place for all students. I would love your support in running for senate! Email me at upadhyar@stanford.edu for questions, concerns, or if you want to talk about anything health policy and data science :)","user":"upadhyar","signees":["adyant","akps","arpitr","atalati","avaace3","awalley","azhan9","beckym","bergc","diegok12","dustinhu","estalcup","etiao02","graghav","gurmenb","huertam","jhundal","kaif","khaledk","kylaguru","maixee","nagarcia","nsala","pchenhsu","pritir","riyakaru","ronitj","savitha","sestra68","sfuji","sherryl","skrish24","tawosile","tdarryl","upadhyar"]},{"id":980191037,"topic":"ugs","slug":"gabe4senate","title":"Gabe for Senate","content":"I'm Gabriel Frank-McPheter, and I'm running for undergraduate senate. I'm a pre-law student with a strong interest and background in policy that I hope to bring to ASSU. My platform is fighting for fairer funding! Specifically, \n1) Funding clubs. This year, ASSU cut funding for a number of important clubs, such as Society of LatinX Engineers and Mock Trial, on what are essentially technicalities, while other clubs with significant outside funding continue to receive ASSU support. As senator, I'll make sure that diverse, student-led organizations receive the funding they need and deserve. \n2) Funding transportation. Reinstate the N, O, and Shopping Express Marguerite Lines, as well as create a Marguerite Line to East Palo Alto, so Stanford workers from EPA can easily commute to campus, and students can easily commute to EPA for community service projects. During winter quarter, I was part of a project group that worked with SEIU 2007, the service worker's union on campus, to research housing and transportation needs. As senator, I'll forge a relationship between ASSU and SEIU, as well as sub-contracted workers, to help survey, fund, and fight for worker transportation needs such as vanpools, marguerite expansion, and gas subsidies. \n3) Funding low-income students. Stanford has been generous in some ways with financial aid, but students with large families, or students just above the income threshold, often get left out with financial aid policies. Likewise, once FLI students get to campus, the process of applying for grants for needed travel and transportation can be long and difficult. As senator, I'll fight for expanded financial aid and FLI funding, and easier to navigate policies for FLI students like myself. \n4) Funding sexual violence response and prevention. More support for organizations like Sexual Violence Free Stanford, and fighting for policies that direct resources to combatting our university's endemic sexual violence. As senator, I'll also support the voices of people and organizations that share their proposals and experiences with ASSU.","user":"gabefm","signees":["abbychee","adzhang","aileenle","aili","alt11","alvin2","amdedios","anahi612","ananthv","ange1ine","annase","annelic","apquiroz","aprabu","arushig","asmith26","atmanj","avaace3","badilloc","bibiana","bkinder","bolshen","btf","cbeamer","ceesa","chavicoy","ciraulo","csblack","ddesir","deandre","doueiriz","dsallis","dwiley26","eapple25","ebrad2","ekatz0","elianac2","elijahbw","elkinm27","emilyguo","faithf","faizan","gabefm","gaustinb","govande","gracejxq","gwk","hunter04","jas1016","jascui","jennaali","jk0530","jm2025","jnfong","jrbahk","jubayer","jvz0711","kasha","katsm","kjdhir","kkhadavi","kmessai","kramerrr","kwahal","leemary","lsalaz","mdhafer","mfenyo","mgoodson","mirawan","msimp","mweis2","nadiac","newsom","ngom2803","nharvey","nicolese","okonkwo","pchx","ptvera","rebecwu","rosentha","rranjan1","rubijsb","sajidof","samani","saniss","schieber","senkaih","shaedol","sherryl","shiningx","sophiemg","sophiesz","tdalmia","tdarryl","thuang26","torred","tracywei","wang1080","wberr","yanakim","yuvrajb","zhuojing","ztrexler"]},{"id":980191034,"topic":"ugs","slug":"isaacforsenate","title":"Elect Isaac","content":"Elect Isaac!","user":"isaac007","signees":["acleyva","ajoshi45","akps","alexpaek","angela20","anggar24","angram24","atidd","avilla16","bbyan","beniam18","bradmoon","brionqye","carias","ccahilly","cfsan86","clough7","codyho","cp0249","csor503","cvu1","dcneese","deepans","dmoore24","drico","dylan24","ehuangc","erouffy","gdmagana","geathers","grincon","gseir","gurmenb","gvadmal","hmusi","huertam","hwqin","ilanlad","ishaanks","ixxia","jchen04","jcoronad","jeflores","jenkin02","jk23541","joannajo","joelx","joshuwa","jrothkow","jtseng20","jwei31","kathli","krjavins","lafuta","lauralb","mario24","mariogn","mcyprien","mdr0321","mgrewal","mjardetz","nathangk","nolaye94","nsalunke","nylewong","oliver88","omqueeg","poojanp","purisima","reeves1","rehaan","rosa2024","rpalleti","rvillada","ryin0","sali786","samthapa","samxing","sarahs38","schoi02","sergioc1","sgonz","sherryl","smacharg","smixon","sscherf","teland","thatcher","tkota","tolitate","tshim24","tsurti","vktran","vladgm24","waymon","willmich","wsurgent","wwang28","zanechan","zcadiz"]},{"id":980191038,"topic":"class_pres1","slug":"soft","title":"The Choice isn't Hard, Vote S.O.F.T.","content":"We are David Sengthay, Ara Omitowoju, Ethan Farah, and Farah Tantawy — S.O.F.T.\n\n[Image ID: David (S), Ara (O), Ethan (F), and Farah (T) in front of MemChu.]\n\nAs candidates for Sophomore Presidents, we believe that our platform represents our commitment to serving the diverse needs of our class. Our goal is to enhance student life at Stanford by creating a more engaging and inclusive campus culture, connecting students with resources for success, and prioritizing student input and feedback in our initiatives. With our experience and dedication, we are confident that we can make a positive impact on the Stanford community and make your voice heard. Vote S.O.F.T. for a SOFTmore year unlike any other.\n\nA summary of our platform, for more information: Our Platform — The Choice isn’t Hard, Vote S.O.F.T.\n\n“• (S)OPHOMORES LOVE FUN: As Sophomore Presidents, our goal is to improve the student experience at Stanford by creating a more engaging and enjoyable campus culture. Students should have the opportunity to work hard and play hard. We're committed to making that happen as your presidents. We all have a hand in creating a vibrant and engaging campus culture that benefits all students at Stanford. \n• (O)PTIMIZING CAMPUS RESOURCES FOR STUDENT SUCCESS: As a Stanford student, you have access to an incredible range of resources, organizations, and funding opportunities. Unfortunately, navigating these resources can sometimes be a challenge. That's why we're committed to making it easier for you to connect with the resources and organizations that will help you thrive. \n• (F)EELING @ HOME AT STANFORD: We believe that a strong sense of community and connection is crucial for student success and happiness at Stanford. As Sophomore Presidents, we are committed to creating a welcoming and inclusive campus culture that makes everyone feel at home. Our goal is to organize events that bring together students from diverse backgrounds, parts of campus, and majors. We want to provide opportunities for you to connect with other students beyond your dorm and classes, and to build a sense of community that extends throughout your time at Stanford.\n• (T)AKING STUDENT INPUT AND FEEDBACK SERIOUSLY: We recognize that our slate of four presidents cannot fully represent the diverse experiences of our entire class of 1700 students. That's why we are committed to creating space for all students to share their feedback and concerns, and to ensuring that your voices are heard and represented in our initiatives. To show our need to hear from you, we have created this Google Form to solicit your thoughts.”\n\n\nGet to know us; for more information: Who We Are — S.O.F.T.\n\n“• David (S)engthay: Hey, y'all! My name is David Sengthay. As a resident of Okada in Neighborhood S and a prospective Urban Studies major, I'm committed to making Stanford a better place for all students. I'm involved with this year's Frosh Council and currently serve as one of the Communications Chairs. Those emails, Fizz posts, and Instagram stories—that’s me! Being on Frosh Council this year was a dope experience, and I want to keep working for y’all next year as one of your sophomore presidents! Through my role, I aim to make you feel at home at Stanford and connected to your class and peers. Feel free to reach out to me (especially about the functions we’re pulling up to this weekend). Contact: sengthay@stanford.edu or @delusional.david.\n• Ara (O)mitowoju: Hi, everyone! My name is Ara Omitowoju, and I currently live in Ujamaa in Neighborhood R. As of now, I’m thinking about studying Biomechanical Engineering with potential minors in Material Science, FemGen Studies, or Film and Media Studies. Coming to Stanford was a real eye-opening experience for me, specifically being able to interact with people all over campus from different backgrounds. I am currently involved in club soccer and an intern at both the Black Community Service Center and SBSE. I love talking to people, so feel free to reach out with any questions, comments, concerns, or just to chat! As one of your Sophomore Presidents, I’m committed to being the bridge between us students and the administration (the people with motion). Contact: araomit@stanford.edu or @araomitowoju.\n• Ethan (F)arah: Hey hey! I’m Ethan Farah, and I am a current resident of Crothers Hall in Neighborhood N planning to major in Biomechanical Engineering! Right now, I spend a lot of time in the Haas Center as a Frosh Service Liaison as well as working with EPASA and HSSI to tutor math (and other subjects) to high schoolers and middle schoolers in nearby schools. Outside of community service, I work with the Stanford Students in Biodesign group as a part of the Launchpad (class-designing) Team. Attending Stanford was always a wild fantasy, but now that it’s become true, it’s time to see what the S.O.F.T team and I can do for Stanford—that’s YOU ALL! If you elect us, we will have the resources to make your Stanford a reality. Please reach out talk with me about anything (I’ll always make time for y’all). Contact: efarah@stanford.edu or @ethan.farah.\n• Farah (T)antawy: Hello hello! My name is Farah Tantawy and I’m currently living at Cedro in Neighborhood S! I’m hoping to go into Public Policy and CSRE, potentially minoring in sociology, philosophy, or data science! I’m currently an alto in a musical group called Side by Side, a member of SWR, and working as a tutor! Being first-generation and low-income, getting into Stanford has been a dream come true, but I know that this University has the resources to create much needed change. As your Sophomore President, I intend to make that happen! Feel free to reach out about literally anything! I want to hear what you guys have to say + I literally never shut up! Contact: ftantawy@stanford.edu or @farahtantawy.”\n\n\nWe hope that we can count on not only your signature but also your vote for S.O.F.T. for Sophomore President!\n\nTo 2026 and Beyond,\nS.O.F.T.","user":"sengthay","signees":["tjp2608","ashleyt7","jkothari","sukara","anushkad","mars7418","charjcp","karen330","fonsecaj","djcald04","valbanez","lenaxvii","efeleke","mygoldin","sengthay","lernest","arabof08","mirasv26","rmabdull","aky2026","gracekt","rzwet","alanaesp","gpolite","araomit","luis1031","adibsood","vchiprez","jsnl","cjcang","zmouza","ginelle","abeldag","rmoseley","talharao","mromain","markrc04","iroman13","amytngnn","ftantawy","aileenle","amdedios","daphyu20","jamesu72","samdizon","kvseet17","esther23","ncorrea4","maxjcamp","amiri03","aew0114","gmart8","gmontes","truccam","estemend","nguyen04","gsandman","kramerrr","glallen","cnichol","sayp","cesy04","kaylaw17","mamoah","summer04","gerwin08","babayeju","titus000","aoakes97","efarah","bless","newsoms","gstretch","dawn9","jonahsi","kenji3","amaliep","elijahd3","krclarke","muhsihsi","agcruz","oshebala","ddesir","akhey","edebelen","alonzia1","rocamora","gabreu","nallen21","mtruong3","agliang","achau774","rchiek","amarwaha","smayeski","dy92634","tyhosein","ireneyan","dmaemoto","htran04","ngualexa","jaylonj","zaza3","jtikare","jmtejeda","jzhou8","isaackan","jmoua","lilianch","agrawald","mclewis1","sachinss","nabiraya","comcbeth","zhane04","akxzhang","kellysb","emily49","semrai","soph26m","ayaan26","aaburous","anushkav","jasagye","scsuh","athena04","leelind8","dkapadia","bjlim26","liannec","ivypchen","amsal","jsclark","jenyxlin","vicheng","jaej0112","avnivats","alexra24","sarasuch","ksig","akay2004","gmw","elanna","keira","irenelin","linhtvo","mgolds","zasemota","giseller","etatlock","mkc3399","vson","sohanc","rubistha","ryansb","nguyenbk","czhang7","cduong03","ah072084","jjyim","nmenon26","pm1220","otranin","jaxdiego","boomer22","gwk","nneoman"]},{"id":980191045,"topic":"gsc","slug":"emmitgsc","title":"Emmit Pert for GSC (Natural Sciences)","content":"Hello y'all, \n\nI'm Emmit, a third year chemistry PhD currently involved in my department's internal activities and the Stanford Solidarity Network. I'm interested in representing the School of Humanities and Sciences. My primary interest in running is to work in concert with the SSN to address graduate student affordability concerns and to continue to advance fair treatment for graduate students of all stripes.  I'm particularly interested in pushing for more graduate student input into RD\u0026E, particularly the rent cost increases and the generally unresponsiveness of RD\u0026E to serious maintenance requests. I would be honored to represent Stanford's graduate students next year! ","user":"epert","signees":["awampler","epert","erpark","eschell","gossd813","ljberg"]},{"id":980191040,"topic":"ugs","slug":"elkinwillstepin","title":"Elkin for Senate","content":"Hellooooo, Stanford!\nMy name is Elkin Mantilla, and I would like to be your sophomore senator for the 23-24 school year. I come from New York City, but I was born and raised in Bucaramanga, Colombia. Alright, enough introductions you're probably wondering why I should be your undergraduate senator. \n\nI am passionate about the solutions that I advocate for because I, like all of you, will benefit from them. As the Neighborhood F programming intern, I have had the opportunity to see firsthand the value that good university events provide to students' mental health and social life. As a member of SIAS and MUN, I have the responsibility to attend meetings at night, and I am not exaggerating when I tell you that sometimes I cannot see a foot in front of me. And, as someone who sometimes just needs to take a break from campus, and does not own a bike (that one is on me), I know the frustration of the Marguerite not running on the days that it is needed most.\n\nWhile I hope to be able to make a positive change through the policies that I have detailed in my platform, as many of my fellow candidates will tell you, I do not know ALL of the issues that affect Stanford. And so, I hope that you feel free to reach out to me by email (elkinm27@stanford.edu) if you have any suggestions or questions about my campaign. \n\nThanks for your time!\nElkin Mantilla","user":"elkinm27","signees":["aayush2","adehmani","akios","alixf","ansarin","arzola26","bristueb","dkavi","eabarca","erinye","gaustinb","janay17","jdgrayso","juik","kasn","kjdhir","mirawan","mweis2","onyie","rcarolan","rohanpar","sebvas","sestra68","sfazioli","sherryl","sophiemg"]},{"id":980191048,"topic":"ugs","slug":"nick4senate","title":"Nick Harvey for Senate","content":"Hello Stanford! My name is Nick Harvey, and I am a freshman running to represent you all on the Undergraduate Senate. I want to bring my interest in policy as a resource to help improve student life and well-being.\n\nSeveral of my goals include:\nTransportation:\n1. Continuing to push the administration to expand Marguerite bus service by reviving the N and O bus lines, as well as the weekend shopping line. (I love public transportation!)\n\n\nStudent democracy:\n1. Expanding a culture of democracy on campus by improving opportunities for students to have direct input in decisions. In high school I ran a participatory budgeting campaign where students voted on how to spend part of the high school library budget, and I want to bring this same zeal for democracy to my role as Senator. I will also survey the student body during my term to make sure I am focusing my energy on the policy areas that matter most to you.\n2. Ensuring ASSU accurately represents the student body by working to improve election turnout, with the 2022 ASSU election having only 17.9 percent turnout. This low turnout also makes it difficult for the student body to amend the ASSU constitution even if a majority of voters are in favor of an amendment, because a quorum of voters is required for an amendment to pass.\n\n\nStudent well-being and community:\n1. Improving mental health resources on campus, including by hiring more CAPS counselors and soliciting student input on how to improve mental health resources.\n2. Encouraging administration to bring back the open door policy. A punitive culture around alcohol scares students into not seeking help for alcohol-related issues.\n3. Build community within dorms by supporting RAs’ efforts to build community (for example, by creating an RA ideas bank where RAs from different dorms can share on-call ideas with each other), rather than dumping more resources into the neighborhood system.\n4. Working with ResEd to make sure students can rank options for preassigned housing, rather than only being able to select their first-choice option.\n\n\nASSU is already advocating for many of the policies I and other students want to see (expansion of the Marguerite, improved mental health resources, etc.), but the administration often ignores student wishes (as happened recently when the administration denied the possibility of bringing back the N and O Marguerite lines). ASSU doesn’t have the same power to enforce decisions that admin does, so I want to help develop partnerships between ASSU and other groups on campus to organize and achieve policy wins for students.\n\nI am very aware that a year-long term is a short amount of time to be able to advocate for bold policy change, but I will try to affect as much positive change as possible in that short amount of time. If you have questions or ideas for policy as I continue to add to my platform, please email me at nharvey@stanford.edu or message me on Instagram at @Nick4ASSU. I look forward to hopefully earning your vote!","user":"nharvey","signees":["adzhang","annase","askor","asmith26","avaace3","badilloc","changtif","crkang","doueiriz","dsallis","eaavila","eapple25","ebrad2","elianac2","elkinm27","evageier","gabefm","glallen","gsandman","gwk","inehring","jdgrayso","jennaali","jkurtzig","jm2025","jrbahk","kjdhir","kwahal","levinh","lsalaz","mweis2","nicolese","ortricio","samani","saniss","schieber","sestra68","sherryl","shiningx","sophiesz","titus000","wberr","yuvrajb"]},{"id":980191043,"topic":"gsc","slug":"habeebforgsc","title":"Habeeb for GSC","content":"A lot of graduate students struggle to make ends meet, trying to find a balance between study/research, paying expenses, and trying to keep a healthy mental and physical state. My goal in running for the GSC is to continue the current work being done by the current members, especially in the area of improving affordability, and better physical and mental health coverage for graduate students.\nIn addition, with the increasing number of Muslim students on campus, I aim to ensure there are enough resources as it pertains to dining accommodations and the necessary frameworks to improve the overall Muslim campus experience.","user":"habeeb1","signees":["aarahim","alamerst","aneeqa","eschell","fathali","gelnesr","hamza410","harun19","hashem","hayatab","ijaodola","kabiose","naoshint","o6665767","rahemeen","sausan","shahir","shoaibmh","zainab93"]},{"id":980191044,"topic":"exec","slug":"sophia_kyle","title":"Sophia \u0026 Kyle: Fun Strikes Back","content":"STANFORD USED TO BE WEIRD AND WONDERFUL. WHERE DID THE FUN GO?\n\n\nStanford today is a completely sanitized version of its former self. Administrators have meddled in every aspect of student life to strip Stanford of its character. In the process, they disrupted the organic, wacky, and inclusive spontaneity that made Stanford so special.\n\nStanford is changing before our eyes: Stanford implemented the neighborhood system without any student feedback, during a time when the pandemic made collective action impossible. Longstanding Stanford traditions, such as Full Moon on the Quad and Secret Snowflake, have disappeared without a trace. A complex patchwork of policies and unnecessary administrative obstacles make it outrageously difficult for students to plan events (speaking from experience!). Funding and locations are never made available for the initiatives that students actually care about. Instead, they go towards lifeless and uninspired neighborhood events that make a mockery of what student life used to be (and attendance reflects this).\n\nThese changes have so intensely limited the outlets for student life that Stanford feels far less inclusive than ever before. We all feel it. This is not what Stanford should be.\n\n\nWe want Stanford to be a place all students feel empowered and supported in developing community on campus, in whatever unique ways bring them the most joy. Remember the idea of Stanford that we all fell in love with? The one we started dreaming about as soon as we saw the confetti on that admissions letter? We want to bring back the old Stanford. We think this is possible.\n\nStudents have complained, protested, and pleaded, yet they have no voice. ASSU does nothing, and administrators blaze forward in their destructive path. As ASSU executives, we would have a unique opportunity to speak directly with administrators, consistently, thoughtfully, and honestly. It is time for fresh, passionate voices to inspire a new agenda and lead ASSU back to the soul of this campus. We will use this platform to tackle the issues students actually care about.\n\nWe are not ASSU insiders, just two motivated students that really care about recovering what we have lost. Sophia has served as the Co-President of the Jewish Student Association (building community and working constantly with admin), is part of a team bringing back Farm Fridays (an old, fun row tradition), and looks forward to storming the field at Big Game this year. Kyle has served on the Black Student Union, as a Club Sports Captain, and as a Greek Life Event Organizer, all while taking rafts into Lake Lag and being a drummer on the sideline of soccer games. We have extensive experience working with admin and can make Stanford a more inclusive and vibrant community.\n\nFollow @funstrikesback. Share your feedback here. Full platform here. \n\nSophia Danielpour (sophiagd@stanford.edu) \u0026 Kyle Haslett (khaslett@stanford.edu)","user":"sophiagd","signees":["zdo","emmwang","miaschau","kapd","bzk","kiarashs","ithobani","o6324408","bross35","c8g","srstern","bzuerch","wogden21","tmaster","egurwitz","rostami","levani","cchico","jr2","kjavi","maff2023","mabrams4","celiadpr","tscm00","nharvey","sdelp3","devholl","mikemaho","ssmith15","evendrow","faiqf","cweintz","fedez","elliotdw","schaider","eschon22","jchudnov","jhoff125","akupor","skylarb","acoll3","wesrojas","ctoups22","riareddy","nmossmer","lrust","avaj","lvblack","smoadel","benc2","nmilan","nbregman","mcmetz","sophiemt","kskraft","nora23","jagross","sagehs","mabern","smiti06","batelaan","jmchris","kogen","simoncov","vpratt23","msimp","shieinav","slehman","krgeorge","jolah","csarkis","laytonr","elowet24","castein","ruben905","jthaman","ujwal","iaa5","jdc0405","jhneidig","gsheen","chemtob","aalinur","bilene","zhoffman","jarment","ethuang","mfkhalil","etrl","callier","wseymour","nicole01","slove23","akavin","kayson","alexder","amthorpe","efajer","waymon","francis6","mailesp","dsarraf","alexkea","stanroze","wangph","dfeinman","gmg0104","nacohen","eluna1","njlevine","ben512k","btf","pcarv","jmc312","parthav","dauber23","sajansm","kbuntic","eproctor","rselwyn","cagraham","fclunan","alicohen","easha","smeunier","edwardt3","carlscho","barbara1","j21ls","celestew","beleigh","aah2024","tdadams","bkuglen","kools","dahmad1","cp0249","taulakh","bbower","daniamlo","bergc","bdharris","danelian","cath24","mariodp","nilz","irmak","saraeg","jaxfloyd","kkings","mjardetz","ggg425","lhughes2","mhutch24","afnaan","fin","ljloughr","leeallie","arnavk","jmarsal","nmo","isa16","kmoore8","dianesks","linds8","judereif","idp2024","annellat","averygw","makennat","shaury","s1dharth","mayasrin","danguo","alougeay","swoodrow","meiers","anaagar","aydhall","ijordan","kgilbai","schaferd","pling1","imercado","gjcarter","rylind","jasmv502","jtransom","mayajlee","ecriss","kpodosin","pchx","drfein","caeden","julesd","aliang01","sammy7","nswidey","liug0226","malevr","rmlit","faierman","colegurt","afeinber","tntieu","vherdz","jordanam","snoah","kmpeng","siwooahn","cvu1","arman02","patel24","swondsen","weihchen","fathuma6","ericmnts","andrewl5","gradyh","alkupor","dganesan","ritap25","zlynch","rheak","mnath","samgb","ananyasr","ari17","cramos25","afelton","jackgiv","sydneymk","spenglas","dzeibert","abbiem","ariarias","kellydan","kisaq","sgever","bbui","jchud","biancad1","alexshaf","zoebum","peterc25","jcarruth","faithf","nicortes","jasmyn","hgris","mrozin","ericktrs","msoul","penfold","scottvu","nkuo","pgrove","rshreya","soonie15","bdevnani","jennaali","mbrown12","annag25","ebtroast","jeremybm","ryank123","saifnasr","mcolborn","nreisner","arialee","jumlas","hmann","deveen","kevin25m","oledbury","leesusan","chelscho","cslatt","elleny","mikaelao","pablonp","zzafran","ktully03","kealiav","nmaltz","joannedp","tgolob","anavib","gbg222","pronisvh","ivanjj","jaimeem","andman","mirelys","natsins","rosentha","pjasmine","calcntar","aargy","sarahrm","asingh11","n20bej","nhafer","sidshr","tegirard","cmcasey","asterra","ariglenn","osibal","eholm","sestra68","dorsey24","estewu","sontee18","hferg","alkopff","upadhyar","csossa","hoskins1","robins25","briannaf","mnditt","wali","megolomu","isagxd","lauhowe","rmabdull","kszheng","diegobus","csittler","ccheng26","gpolite","chehan","rparker1","jrlp","araomit","kateb29","allise","jsnl","jchens","ginelle","fishera","smacharg","agupta07","sebcolon","iroman13","ceesa","varanda","msomers","arjvik","hasan17","hrg","clairero","lucib","jlasiota","mis01","cekstrom","maya3ac","mduffy8","aileenle","weshicks","avalove","sheina","zteplin","mimoya","mpeters4","alisaga","elee23","egreenwa","ideutsch","aqib","mottesid","jhundal","huertam","elijahbw","ajpat","renn2024","maxjcamp","dinarazi","alexlee3","truccam","hmunoz","senkaih","sebasur","gsandman","lucianab","ehadar37","dcureton","serena25","bkinder","aili","kghosh04","ahmadk","haileyh","bella06","cam4567","izzyterr","tedhick","hyunjun","pipervw","afishpez","andrewrk","jrhee25","titus000","gabbytan","mkounga","dwoong26","iszabo","zoecm","tkprice","gstretch","zachwitz","jcos","armitahj","pranavg","ckenz","tamiro","mircheng","deangrey","leah26","krclarke","skasi","marcosg","louisr","eaubry","nicozez","maya31","mweis2","rwchan5","lauren04","etardif","iacohen","aclaire","porsche","agrawald","smijat","jackffox","ediller","esidhart","berkyalc","gcandrew","samshors","salberti","yonigoz","kissane","amsal","kkhadavi","ellabp","joshwal","ajadhav","shreyas3","cyeh2003","jaslew03","agreen99","rranjan1","ndye26","jamesp26","jfenton","awestley","ishritap","mwigler","cschurz","calvinb4","david27","enrocha","epress","ceeng","ards2004","ocotto","src2","luke2004","amagalla","epollack","svolman","gfarley6","jarren","emokine","juliamj","sands","jas1016","wgolub","guylevin","chanty24","ekohrman","korol","aidanfay","grane","cate02","lvanderk","bcleary","daniee"]},{"id":980191047,"topic":"ugs","slug":"diegocalderon","title":"Diego C for Senate!","content":"I am Diego Calderón, a freshman from Arizona running for Undergraduate Senate. I want to represent all Stanford students especially my FLI, Latine, and queer communities. My interest areas are:\n\n1. Improve transportation on campus (bring back N, O, and Shopping Express lines).\n\n2. Fight back against sexual violence and make Stanford a safer place without increasing surveillance.\n\n3. Increase resources for the FLI community.\n\n4. Make Stanford Fun by making it easier to throw events and fighting to keep Lake Lag full.\n\nI’m glad to hear Admin is taking some of our suggestions like bringing back the Shopping Express line but there is more work to be done. I love Stanford so much and I’d love to make it a place we’re all proud of. ","user":"djcald04","signees":["adehmani","adityau","ajadhav","akary","atorresc","chrstnk","cordovam","ddesir","diegolg1","ediaz04","gaustinb","grace15","hasan17","hongmeng","ireneyan","iroman13","jsnl","karen330","kramerrr","krlai","lamya26","lindav","massiel","miclop16","nancys03","rachzav3","sestra68","sherryl","vren"]},{"id":980191050,"topic":"ugs","slug":"cees4senate","title":"Vote Cees for ASSU senator","content":"Hi everyone!\n\nI’m Cees, a freshman and international student from Singapore who wants to play my part in helping Stanford improve.\n\nI am running for the Undergraduate Senate to ensure that international students are represented, club sports are funded and the neighborhood system serves the interests of everyone here.\n\nIf you have any questions, feel free to reach out! I’d love to take any at ceesa@stanford.edu!\n\nBest,\nCees","user":"ceesa","signees":["aajerby","adesai10","agam2026","aliang01","aliyan","aniketm","arabof08","ayaan04","bdono","bkamm","cbeamer","ceesa","csherry","davidlu7","diyais","henrys1","ivantoh","j21ls","jchen04","jeklund","jgupta26","jjoner","jlopez04","jmtejeda","kateb29","kenlal","kghosh04","lawr3nce","leealex","lenamik1","louisr","lshuman","lspunt","mganne","miggyjv","mnasra","mstjohns","nkehoe","o6684211","pabari","qam","sestra68","sherryl","tadamo","tanmayg","tganea","thaneb","vgarodia","vihaan","vren","walker23","wbriger","wgolub","yanav","yuvrajb"]},{"id":980191052,"topic":"gsc","slug":"voteforperry","title":"Perry Nielsen Jr for GSC Rep!","content":"Hello Everyone,\n\nMy name is Perry, and I am a first year Master's student in Health Policy at Stanford School of Medicine. I feel very passionate about the initiatives of the Graduate Student Council from the past year, and believe I could help to shape the council's future efforts to advocate for graduate student's affordability, access, and equity. Though I am new to Stanford and the West coast, I attended a great number of the Graduate Student Council's meetings during Winter Quarter, so I feel confident in my ability to represent the student body fairly and push for the initiatives that people care about most!\n\nKey Issues: \nHealthcare Access (Discounted Cardinal Care for Master's Students, Mental Health Coverage)\nAffordability (Cheaper Dining Options, Expansion/Awareness of the Food Pantry Pop Up, Marguerite Shopping Line)\nCommunity (Partnership with CA's and VSOs on All-Grad Events, continued Social Engagement)\n\nThank you for reading my page!\nPerry Nielsen Jr","user":"perryknj","signees":["erpark","eschell","ljberg","xtchang"]},{"id":980191053,"topic":"ugs","slug":"jamieforassu","title":"Jamie Hamilton for ASSU","content":"Hi everyone! \n\nMy name is Jamie Hamilton and I'm excited to be running for ASSU Senate. Stanford is my home – not just because I live directly next to campus, but that in years as a student here I have come to love this place, and most of all, its people. I believe that Stanford is home to a creative, fun, diverse, and, of course, extremely intelligent collection of students. Stanford students have the capability to make this campus the home of wacky irreverent fun that it has been for so long. \n\nYet in recent years, particularly after covid, the administration has cracked down on students and created an overburdening bureaucracy that suck the life out of this place. Parties have to be registered weeks in advance, and admin approval is required for almost everything. Students are not treated like the intelligent and capable group of adults we are, but as mere liabilities that need parenting. If elected to the ASSU Senate, I will work to empower students to take back control of campus life. As a student who experienced Stanford before covid, before the neighborhood system, I know the potential this wonderful place has, and what we can work towards. \n\nMy main goal is to bring power back into the hands of the students. I appreciate your time reading this, and hope you consider voting for me.","user":"jwh33","signees":["jdc0405","lucianab","sestra68"]},{"id":980191054,"topic":"ugs","slug":"owen4senate","title":"Owen Brown for Senate","content":"Dear Stanford Community,\nMy name is Owen, and I'm a sophomore running for ASSU this year. I'm running to address issues with the neighborhood system, R\u0026DE, food quality, and safety. I've listed my experience and some action items below, and I humbly request your signature on this petition so that I can run on the ballot to be one of your undergraduate senators next year. \nExperience: Class of 25 Frosh Council Representative; Senior Class President (high school); Solar Regatta Club President (high school)\nAction Items: Advocate for the return of lunch specials like the Stern burrito station, work to address campus-wide safety issues, make fundamental changes to the neighborhood system to increase student confidence in the system, advocate for easing administration oversight of parties and other student gatherings","user":"obrown1","signees":["afishpez","alkupor","bbroido","bpatrick","cath24","cfrangos","ebarrosa","etianshi","evagoren","holdentn","ikmardin","jaimeem","jamieu","jasoncl","jmb25","jmolloy","joshia","jvarah","kroegerj","ksesben","lholiday","lukeveit","macks26","mreinstr","peterc25","rhyslb","ryin0","sachino","sasloan","sestra68","sherryl","tgolob","zteplin"]},{"id":980191059,"topic":"gsc","slug":"lizforgsc","title":"Liz Park for GSC","content":"Hi yall,\n\nMy name is Liz! I am a third year PhD candidate in chemistry. I'm here to continue fighting for key issues on campus, such as the after hours Marguerite service, full return of the Shopping Express Marguerite, off-campus subsidies for transportation, expanding accessibility of transit (especially DisGo!!) and continuing to hold the administration of this university accountable.","user":"erpark","signees":["awampler","eschell","gossd813","jand271","krapivin","ljberg","skavya","xtchang"]},{"id":980191064,"topic":"class_pres2","slug":"anewera","title":"Re-elect Hasan Ahmad: Usher in a New ERA","content":"Hello Junior class! We are Hasan Ahmad, Ismail Mardin, Charlie Nicks, Silvana Alfaro, Vedant Garg, and Sofia Vera Verduzco. We are E.R.A., and we are so excited to be running to represent you during the 2023-24 school year!\n\nHasan Ahmad represents you this year as a part of the R.I.S.E. Sophomore Class Presidency. He helped bring you events such as Night Market, Sophomore Formal, Sophomore Sunrise, and Mental Health Boba Nights, and he is excited to return next year with even more exciting events.\n\nWe have three simple, core goals:\n1. Enthusiasm and Fun: We believe that no matter what your definition of fun is, college is a time that everyone deserves to look back on fondly. A strong community is built on respect and care for the perspectives and convictions of each member. But, it is also built on novel and exciting shared experiences! We pledge to deliver programming in service of both of these goals. This is college – we’re supposed to have fun!\n2. Representation: Our goal is to remain as close to the wants and needs of the class of ‘25 this upcoming year. Our top priority is responding to feedback from you, and we plan to launch several programs to achieve this goal – including a quarterly election where ‘25ers can let us know what kinds of events they want to see. While we’re super excited about all of the programs and initiatives that we have in the works right now, it should be up to you to decide what gets finalized. At the end of the day, this isn’t about us, it’s about you. Class presidency is a service position, and we’re here to help uplift your voices\n3. Action: Ideas and ideals can’t bring you an awesome Junior experience on their own. Being a class president shouldn’t just mean ideation and brainstorming – it should mean hunkering down making sure that we deliver on our promises. We are a group of people who love event planning and who are passionate about the work that comes with this role.\n\n\nBut our plans go beyond our high-level goals. Some of the new programming we’re planning for next year includes:\n1. Quarterly Junior town halls. As your feedback is extremely important to us, we will be hosting quarterly town halls when you are welcome to come share your comments or ideas on programming and events with us. We hope that pizza on us will convince you to swing by!\n2. Accessible pre-professional and pre-academic resources. We know Junior year is very important professionally for many, and that can be a source of a lot of stress. We would like to help ensure that everyone can have access to resources to navigate your paths. This will include hosting mentorship events with faculty and partnering with CareerEd to have on demand resources available. \n3. More off-campus events. There are so many amazing places and things to do near Stanford, but we know sometimes it’s complicated to take advantage of these things whether that be because of logistics or cost. We want to ensure that everyone gets the opportunity to live all these incredible off campus experiences by organizing more trips and events. \n\n\nOur slate includes a wide variety of experiences and backgrounds including:\n1. One of your class presidents this year (Hasan) and a group of ASSU outsiders to bring in fresh ideas.\n2. Five international students from five different countries (everyone but Charlie, but she’s a Canadian citizen so maybe that counts for something?).\n3. Six different majors.\n4. Four students who have experience in leadership, all in different VSOs (Charlie, Sofia, Silvana, and Ismail).\n5. Six people who all have different definitions of what FUN means - we hope everyone resonates with at least one of us!\n6. Four students who have experience in service roles at Stanford (Vedant, Sofia, Silvana, and Hasan).\n\n\nWe think that our diversity and differences are one of our biggest strengths - but not our biggest. Our biggest strength is what we have in common: a love of Stanford, a love of the class of ‘25, and a love of our communities.\n\nWe would be incredibly humbled and honored if you chose us to help shape your junior experience. We promise if elected to help usher in a new E.R.A. of ENTHUSIASM, FUN, REAL REPRESENTATION, and DECISIVE ACTION!\n\nIf you like any of what you just read, you can support E.R.A.’s campaign by signing today! \u003c3\n\nSincerely,\nSofia, Vedant, Silvana, Charlie, Ismail, and Hasan","user":"cnicks13","signees":["abeljohn","alexyang","alinadav","amarcum","anushre","arusha","aryan22","aryangul","asolg","briannaf","bryan101","carsonml","changrc","cnicks13","cthomps","dcguan","deveen","dfung4","diyasabh","dstauber","dzawa","ecemy","elleny","emmadai","epifants","ericktrs","everettl","faithf","gaustinb","ginger24","grclark","guylevin","hasan17","hgris","ideutsch","ikmardin","ikrement","isalter","ivanjj","ivantoh","j21ls","j9245660","jaimeem","jamorice","jastonm","jbelardi","jchud","jesser18","jmarsal","jrlp","jswahby","jvarah","kalinggo","kellydan","kenanhas","kevin25m","kevinkc","kmessai","kresnick","kristyc","krrish","lishan","ljacoby","lmorley","lucianab","lukeveit","malisha6","manavs","meganmou","mmurra","mmurray5","mnath","mvdvldn","mwyatt","nina0910","nmaltz","nsmejia","nyson25","oekeagwu","pawanw","pchx","psarthi","rainatb","rayansri","riensche","ritikak","rohanc12","romym","salfaro","salman01","samkwok","sammy7","sdsam","shubh","sjsundar","sofiv192","spenseay","sydneymk","sylviaga","tcoghlan","torihoge","tuli","vedgarg","vguru","vikram29","yahiruiz","ykadadi","ysingh","zuzanah"]},{"id":980191066,"topic":"ugs","slug":"mj","title":"MJ for Senate","content":"Hi Stanford!\nMy name is Mahmood Jawad, and I'm excited to be a candidate running for the Associated Students of Stanford University Senate! I have contributed to our community through a variety of leadership roles, including as a social justice director for the Muslim Student Union, a partner with the Haas Center for Public Service, and an assistant with SAPling. My experiences have demonstrated a deep commitment to promoting equity, leadership, and capacity. I have also developed AI ethics strategies with the CASBS Ethics \u0026 Society Review, curated community-building events for the Markaz at Stanford, and coached and organized students through the Stanford University Moral Leadership Project.\n\nAs a first-generation and low-income student, a refugee from Iraq, a Muslim, and a member of a marginalized community, my ambitions and skills motivate me to empower and transform underrepresented communities at Stanford.\n\nIf elected to student government, I am committed to promoting mental health and creating a safe and inclusive environment for all students at Stanford. \n\n1. I will work to increase access to mental health resources on campus, including counseling and therapy services. I will advocate for policies that promote mental wellness, such as stress reduction workshops and mental health days. \n\n2. I will protect students' identities from harm by advocating for policies that prevent discrimination and harassment based on race, gender, sexual orientation, and other factors. \n\n3. I will work with student organizations to promote diversity and inclusion on campus, including events and activities that celebrate different cultures and identities. \n\n4. I will foster a sense of community and belonging among all students, including those from underrepresented backgrounds.\n\nI believe that mental health and identity protection are critical issues that affect all students at Stanford. As a member of the student government, I will be committed to promoting these values and working to create a campus culture that is supportive, inclusive, and welcoming for all students. Vote for me, Mahmood Jawad, to help make a difference on campus!","user":"mahmoodj","signees":["adehmani","afaruk","amayam","aqib","asmaa","bkongtav","cahron","ccahilly","dzawa","ffbdair","howra","hussamig","ihsaan","itbaan10","javokhir","jrizo","lalkhani","mahmoodj","mhamdi42","mimoya","mmkhalil","ngumel12","nourmary","rafaelss","rayansri","samuelmm","sestra68","sherryl","sohaylae","yasserj","yimt","yousef24","yqazi27","ztweedie"]},{"id":980191062,"topic":"ugs","slug":"odin","title":"ODIN + SENATE = YES!!!","content":"Hi, I’m Odin!\n\nWhat I like:\n- Fun\n- Community\n- Trader Joe’s Chocolate Pretzels\n\nWhat I Don’t Like:\n- Wasting Your Time\n\nI’m not going to make you read a laundry list of things I think are important — I care about what you think is important. Feel free to email me (omfarkas@stanford.edu), I’ll make your ideas happen so campus can feel like home for all of us.\n\nCheers :)","user":"omfarkas","signees":["cnicks13","erinye","ivanjj","kasha","rmabdull","sestra68","sherryl"]}]